Ac6Embedded/svd-microchip/SAMA5D3/ATSAMA5D36.svd
            <register>
               <name>COR</name>
               <description>Channel Offset Register</description>
               <addressOffset>0x4C</addressOffset>
               <fields>
                  <field>
                     <name>OFF0</name>
                     <description>Offset for Channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OFF1</name>
                     <description>Offset for Channel 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OFF2</name>
                     <description>Offset for Channel 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OFF3</name>
                     <description>Offset for Channel 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OFF4</name>
                     <description>Offset for Channel 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OFF5</name>
                     <description>Offset for Channel 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OFF6</name>
                     <description>Offset for Channel 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OFF7</name>
                     <description>Offset for Channel 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OFF8</name>
                     <description>Offset for Channel 8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OFF9</name>
                     <description>Offset for Channel 9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OFF10</name>
                     <description>Offset for Channel 10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OFF11</name>
                     <description>Offset for Channel 11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIFF0</name>
                     <description>Differential Inputs for Channel 0</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIFF1</name>
                     <description>Differential Inputs for Channel 1</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIFF2</name>
                     <description>Differential Inputs for Channel 2</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIFF3</name>
                     <description>Differential Inputs for Channel 3</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIFF4</name>
                     <description>Differential Inputs for Channel 4</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIFF5</name>
                     <description>Differential Inputs for Channel 5</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIFF6</name>
                     <description>Differential Inputs for Channel 6</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIFF7</name>
                     <description>Differential Inputs for Channel 7</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIFF8</name>
                     <description>Differential Inputs for Channel 8</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIFF9</name>
                     <description>Differential Inputs for Channel 9</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIFF10</name>
                     <description>Differential Inputs for Channel 10</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIFF11</name>
                     <description>Differential Inputs for Channel 11</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>12</dim>
               <dimIncrement>4</dimIncrement>
               <name>CDR[%s]</name>
               <description>Channel Data Register</description>
               <addressOffset>0x50</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>Converted Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ACR</name>
               <description>Analog Control Register</description>
               <addressOffset>0x94</addressOffset>
               <fields>
                  <field>
                     <name>PENDETSENS</name>
                     <description>Pen Detection Sensitivity</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TSMR</name>
               <description>Touchscreen Mode Register</description>
               <addressOffset>0xB0</addressOffset>
               <fields>
                  <field>
                     <name>TSMODE</name>
                     <description>Touchscreen Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TSMODESelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Touchscreen</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_4_WIRE_NO_PM</name>
                           <description>4-wire Touchscreen without pressure measurement</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_4_WIRE</name>
                           <description>4-wire Touchscreen with pressure measurement</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_5_WIRE</name>
                           <description>5-wire Touchscreen</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TSAV</name>
                     <description>Touchscreen Average</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TSAVSelect</name>
                        <enumeratedValue>
                           <name>NO_FILTER</name>
                           <description>No Filtering. Only one ADC conversion per measure</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AVG2CONV</name>
                           <description>Averages 2 ADC conversions</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AVG4CONV</name>
                           <description>Averages 4 ADC conversions</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AVG8CONV</name>
                           <description>Averages 8 ADC conversions</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TSFREQ</name>
                     <description>Touchscreen Frequency</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TSSCTIM</name>
                     <description>Touchscreen Switches Closure Time</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>NOTSDMA</name>
                     <description>No TouchScreen DMA</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PENDET</name>
                     <description>Pen Contact Detection Enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PENDBC</name>
                     <description>Pen Detect Debouncing Period</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>XPOSR</name>
               <description>Touchscreen X Position Register</description>
               <addressOffset>0xB4</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>XPOS</name>
                     <description>X Position</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>XSCALE</name>
                     <description>Scale of XPOS</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>YPOSR</name>
               <description>Touchscreen Y Position Register</description>
               <addressOffset>0xB8</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>YPOS</name>
                     <description>Y Position</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>YSCALE</name>
                     <description>Scale of YPOS</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PRESSR</name>
               <description>Touchscreen Pressure Register</description>
               <addressOffset>0xBC</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>Z1</name>
                     <description>Data of Z1 Measurement</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>Z2</name>
                     <description>Data of Z2 Measurement</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TRGR</name>
               <description>Trigger Register</description>
               <addressOffset>0xC0</addressOffset>
               <fields>
                  <field>
                     <name>TRGMOD</name>
                     <description>Trigger Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TRGMODSelect</name>
                        <enumeratedValue>
                           <name>NO_TRIGGER</name>
                           <description>No trigger, only software trigger can start conversions</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EXT_TRIG_RISE</name>
                           <description>External trigger rising edge</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EXT_TRIG_FALL</name>
                           <description>External trigger falling edge</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EXT_TRIG_ANY</name>
                           <description>External trigger any edge</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PEN_TRIG</name>
                           <description>Pen Detect Trigger (shall be selected only if PENDET is set and TSAMOD = Touchscreen only mode)</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PERIOD_TRIG</name>
                           <description>ADC internal periodic trigger (see field TRGPER)</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CONTINUOUS</name>
                           <description>Continuous Mode</description>
                           <value>0x6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRGPER</name>
                     <description>Trigger Period</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WPMR</name>
               <description>Write Protection Mode Register</description>
               <addressOffset>0xE4</addressOffset>
               <fields>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protection Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0</description>
                           <value>0x414443</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>WPSR</name>
               <description>Write Protection Status Register</description>
               <addressOffset>0xE8</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>WPVS</name>
                     <description>Write Protection Violation Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPVSRC</name>
                     <description>Write Protection Violation Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
