Ac6Embedded/svd-microchip/SAMA5D3/ATSAMA5D36.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>AIC</name>
         <version>11051J</version>
         <description>Advanced Interrupt Controller</description>
         <baseAddress>0xFFFFF000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xEC</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>SSR</name>
               <description>Source Select Register</description>
               <addressOffset>0x00</addressOffset>
               <fields>
                  <field>
                     <name>INTSEL</name>
                     <description>Interrupt Line Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SMR</name>
               <description>Source Mode Register</description>
               <addressOffset>0x04</addressOffset>
               <fields>
                  <field>
                     <name>PRIOR</name>
                     <description>Priority Level</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SRCTYPE</name>
                     <description>Interrupt Source Type</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>SRCTYPESelect</name>
                        <enumeratedValue>
                           <name>INT_LEVEL_SENSITIVE</name>
                           <description>High level Sensitive for internal sourceLow level Sensitive for external source</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INT_EDGE_TRIGGERED</name>
                           <description>Positive edge triggered for internal sourceNegative edge triggered for external source</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EXT_HIGH_LEVEL</name>
                           <description>High level Sensitive for internal sourceHigh level Sensitive for external source</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EXT_POSITIVE_EDGE</name>
                           <description>Positive edge triggered for internal sourcePositive edge triggered for external source</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SVR</name>
               <description>Source Vector Register</description>
               <addressOffset>0x08</addressOffset>
               <fields>
                  <field>
                     <name>VECTOR</name>
                     <description>Source Vector</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IVR</name>
               <description>Interrupt Vector Register</description>
               <addressOffset>0x10</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>IRQV</name>
                     <description>Interrupt Vector Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FVR</name>
               <description>FIQ Vector Register</description>
               <addressOffset>0x14</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>FIQV</name>
                     <description>FIQ Vector Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ISR</name>
               <description>Interrupt Status Register</description>
               <addressOffset>0x18</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>IRQID</name>
                     <description>Current Interrupt Identifier</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR0</name>
               <description>Interrupt Pending Register 0</description>
               <addressOffset>0x20</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>FIQ</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYS</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID2</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID3</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID4</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID5</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID6</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID7</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID8</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID9</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID10</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID11</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID12</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID13</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID14</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID15</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID16</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID17</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID18</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID19</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID20</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID21</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID22</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID23</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID24</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID25</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID26</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID27</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID28</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID29</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID30</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID31</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR1</name>
               <description>Interrupt Pending Register 1</description>
               <addressOffset>0x24</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PID32</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID33</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID34</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID35</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID36</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID37</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID38</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID39</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID40</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID41</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID42</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID43</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID44</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID45</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID46</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID47</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID48</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID49</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID50</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID51</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID52</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID53</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID54</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID55</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID56</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID57</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID58</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID59</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID60</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID61</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID62</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID63</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
