Ac6Embedded/svd-microchip/SAMA5D3/ATSAMA5D36.svd
            <register>
               <name>IPR2</name>
               <description>Interrupt Pending Register 2</description>
               <addressOffset>0x28</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PID64</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID65</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID66</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID67</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID68</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID69</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID70</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID71</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID72</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID73</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID74</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID75</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID76</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID77</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID78</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID79</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID80</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID81</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID82</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID83</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID84</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID85</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID86</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID87</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID88</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID89</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID90</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID91</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID92</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID93</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID94</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID95</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR3</name>
               <description>Interrupt Pending Register 3</description>
               <addressOffset>0x2C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PID96</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID97</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID98</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID99</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID100</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID101</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID102</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID103</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID104</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID105</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID106</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID107</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID108</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID109</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID110</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID111</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID112</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID113</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID114</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID115</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID116</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID117</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID118</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID119</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID120</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID121</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID122</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID123</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID124</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID125</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID126</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID127</name>
                     <description>Interrupt Pending</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IMR</name>
               <description>Interrupt Mask Register</description>
               <addressOffset>0x30</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>INTM</name>
                     <description>Interrupt Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CISR</name>
               <description>Core Interrupt Status Register</description>
               <addressOffset>0x34</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NFIQ</name>
                     <description>NFIQ Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NIRQ</name>
                     <description>NIRQ Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EOICR</name>
               <description>End of Interrupt Command Register</description>
               <addressOffset>0x38</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>ENDIT</name>
                     <description>Interrupt Processing Complete Command</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPU</name>
               <description>Spurious Interrupt Vector Register</description>
               <addressOffset>0x3C</addressOffset>
               <fields>
                  <field>
                     <name>SIVR</name>
                     <description>Spurious Interrupt Vector Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IECR</name>
               <description>Interrupt Enable Command Register</description>
               <addressOffset>0x40</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>INTEN</name>
                     <description>Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IDCR</name>
               <description>Interrupt Disable Command Register</description>
               <addressOffset>0x44</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>INTD</name>
                     <description>Interrupt Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ICCR</name>
               <description>Interrupt Clear Command Register</description>
               <addressOffset>0x48</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>INTCLR</name>
                     <description>Interrupt Clear</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ISCR</name>
               <description>Interrupt Set Command Register</description>
               <addressOffset>0x4C</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>INTSET</name>
                     <description>Interrupt Set</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FFER</name>
               <description>Fast Forcing Enable Register</description>
               <addressOffset>0x50</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>FFEN</name>
                     <description>Fast Forcing Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FFDR</name>
               <description>Fast Forcing Disable Register</description>
               <addressOffset>0x54</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>FFDIS</name>
                     <description>Fast Forcing Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FFSR</name>
               <description>Fast Forcing Status Register</description>
               <addressOffset>0x58</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>FFS</name>
                     <description>Fast Forcing Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DCR</name>
               <description>Debug Control Register</description>
               <addressOffset>0x6C</addressOffset>
               <fields>
                  <field>
                     <name>PROT</name>
                     <description>Protection Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GMSK</name>
                     <description>General Interrupt Mask</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
