Ac6Embedded/svd-microchip/SAMA5D3/ATSAMA5D36.svd
            <register>
               <name>WPSR</name>
               <description>Write Protection Status Register</description>
               <addressOffset>0x00E8</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>WPVS</name>
                     <description>Write Protection Violation Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPVSRC</name>
                     <description>Write Protection Violation Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>8</dim>
               <dimIncrement>32</dimIncrement>
               <name>CAN_MB[%s]</name>
               <description/>
               <addressOffset>0x200</addressOffset>
               <register>
                  <name>MMR</name>
                  <description>Mailbox Mode Register</description>
                  <addressOffset>0x0</addressOffset>
                  <fields>
                     <field>
                        <name>MTIMEMARK</name>
                        <description>Mailbox Timemark</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>PRIOR</name>
                        <description>Mailbox Priority</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>MOT</name>
                        <description>Mailbox Object Type</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>3</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>MOTSelect</name>
                           <enumeratedValue>
                              <name>MB_DISABLED</name>
                              <description>Mailbox is disabled. This prevents receiving or transmitting any messages with this mailbox.</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MB_RX</name>
                              <description>Reception Mailbox. Mailbox is configured for reception. If a message is received while the mailbox data register is full, it is discarded.</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MB_RX_OVERWRITE</name>
                              <description>Reception mailbox with overwrite. Mailbox is configured for reception. If a message is received while the mailbox is full, it overwrites the previous message.</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MB_TX</name>
                              <description>Transmit mailbox. Mailbox is configured for transmission.</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MB_CONSUMER</name>
                              <description>Consumer Mailbox. Mailbox is configured in reception but behaves as a Transmit Mailbox, i.e., it sends a remote frame and waits for an answer.</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MB_PRODUCER</name>
                              <description>Producer Mailbox. Mailbox is configured in transmission but also behaves like a reception mailbox, i.e., it waits to receive a Remote Frame before sending its contents.</description>
                              <value>0x5</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>MAM</name>
                  <description>Mailbox Acceptance Mask Register</description>
                  <addressOffset>0x4</addressOffset>
                  <fields>
                     <field>
                        <name>MIDvB</name>
                        <description>Complementary bits for identifier in extended frame mode</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>18</bitWidth>
                     </field>
                     <field>
                        <name>MIDvA</name>
                        <description>Identifier for standard frame mode</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>11</bitWidth>
                     </field>
                     <field>
                        <name>MIDE</name>
                        <description>Identifier Version</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>MID</name>
                  <description>Mailbox ID Register</description>
                  <addressOffset>0x8</addressOffset>
                  <fields>
                     <field>
                        <name>MIDvB</name>
                        <description>Complementary bits for identifier in extended frame mode</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>18</bitWidth>
                     </field>
                     <field>
                        <name>MIDvA</name>
                        <description>Identifier for standard frame mode</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>11</bitWidth>
                     </field>
                     <field>
                        <name>MIDE</name>
                        <description>Identifier Version</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>MFID</name>
                  <description>Mailbox Family ID Register</description>
                  <addressOffset>0xC</addressOffset>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>MFID</name>
                        <description>Family ID</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>29</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>MSR</name>
                  <description>Mailbox Status Register</description>
                  <addressOffset>0x10</addressOffset>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>MTIMESTAMP</name>
                        <description>Timer value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>MDLC</name>
                        <description>Mailbox Data Length Code</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>MRTR</name>
                        <description>Mailbox Remote Transmission Request</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MABT</name>
                        <description>Mailbox Message Abort (cleared by writing MTCR or MACR in the CAN_MCRx)</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MRDY</name>
                        <description>Mailbox Ready (cleared by writing MTCR or MACR in the CAN_MCRx)</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MMI</name>
                        <description>Mailbox Message Ignored (cleared by reading CAN_MSRx)</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>MDL</name>
                  <description>Mailbox Data Low Register</description>
                  <addressOffset>0x14</addressOffset>
                  <fields>
                     <field>
                        <name>MDL</name>
                        <description>Message Data Low Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>MDH</name>
                  <description>Mailbox Data High Register</description>
                  <addressOffset>0x18</addressOffset>
                  <fields>
                     <field>
                        <name>MDH</name>
                        <description>Message Data High Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>MCR</name>
                  <description>Mailbox Control Register</description>
                  <addressOffset>0x1C</addressOffset>
                  <access>write-only</access>
                  <fields>
                     <field>
                        <name>MDLC</name>
                        <description>Mailbox Data Length Code</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>MRTR</name>
                        <description>Mailbox Remote Transmission Request</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MACR</name>
                        <description>Abort Request for Mailbox x</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MTCR</name>
                        <description>Mailbox Transfer Command</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
