Ac6Embedded/svd-microchip/SAMA5D3/ATSAMA5D36.svd
                        <enumeratedValue>
                           <name>SRAM</name>
                           <description>SRAM emulating ROM</description>
                           <value>0x4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EXT</name>
                     <description>Extension Flag</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EXID</name>
               <description>Chip ID Extension Register</description>
               <addressOffset>0x0044</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>EXID</name>
                     <description>Chip ID Extension</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FNR</name>
               <description>Force NTRST Register</description>
               <addressOffset>0x0048</addressOffset>
               <fields>
                  <field>
                     <name>FNTRST</name>
                     <description>Force NTRST</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>DMAC0</name>
         <version>6233T</version>
         <description>DMA Controller</description>
         <groupName>DMAC</groupName>
         <prependToName>DMAC_</prependToName>
         <baseAddress>0xFFFFE600</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x1EC</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>DMAC0</name>
            <description>DMA Controller 0</description>
            <value>30</value>
         </interrupt>
         <registers>
            <register>
               <name>GCFG</name>
               <description>DMAC Global Configuration Register</description>
               <addressOffset>0x000</addressOffset>
               <fields>
                  <field>
                     <name>ARB_CFG</name>
                     <description>Arbiter Configuration</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>ARB_CFGSelect</name>
                        <enumeratedValue>
                           <name>FIXED</name>
                           <description>Fixed priority arbiter (see 'Basic Definitions' )</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ROUND_ROBIN</name>
                           <description>Modified round robin arbiter.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DICEN</name>
                     <description>Descriptor Integrity Check</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EN</name>
               <description>DMAC Enable Register</description>
               <addressOffset>0x004</addressOffset>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>General Enable of DMA</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SREQ</name>
               <description>DMAC Software Single Request Register</description>
               <addressOffset>0x008</addressOffset>
               <fields>
                  <field>
                     <name>SSREQ0</name>
                     <description>Source Request</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSREQ0</name>
                     <description>Destination Request</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SSREQ1</name>
                     <description>Source Request</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSREQ1</name>
                     <description>Destination Request</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SSREQ2</name>
                     <description>Source Request</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSREQ2</name>
                     <description>Destination Request</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SSREQ3</name>
                     <description>Source Request</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSREQ3</name>
                     <description>Destination Request</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SSREQ4</name>
                     <description>Source Request</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSREQ4</name>
                     <description>Destination Request</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SSREQ5</name>
                     <description>Source Request</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSREQ5</name>
                     <description>Destination Request</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SSREQ6</name>
                     <description>Source Request</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSREQ6</name>
                     <description>Destination Request</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SSREQ7</name>
                     <description>Source Request</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSREQ7</name>
                     <description>Destination Request</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CREQ</name>
               <description>DMAC Software Chunk Transfer Request Register</description>
               <addressOffset>0x00C</addressOffset>
               <fields>
                  <field>
                     <name>SCREQ0</name>
                     <description>Source Chunk Request</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DCREQ0</name>
                     <description>Destination Chunk Request</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCREQ1</name>
                     <description>Source Chunk Request</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DCREQ1</name>
                     <description>Destination Chunk Request</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCREQ2</name>
                     <description>Source Chunk Request</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DCREQ2</name>
                     <description>Destination Chunk Request</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCREQ3</name>
                     <description>Source Chunk Request</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DCREQ3</name>
                     <description>Destination Chunk Request</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCREQ4</name>
                     <description>Source Chunk Request</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DCREQ4</name>
                     <description>Destination Chunk Request</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCREQ5</name>
                     <description>Source Chunk Request</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DCREQ5</name>
                     <description>Destination Chunk Request</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCREQ6</name>
                     <description>Source Chunk Request</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DCREQ6</name>
                     <description>Destination Chunk Request</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCREQ7</name>
                     <description>Source Chunk Request</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DCREQ7</name>
                     <description>Destination Chunk Request</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LAST</name>
               <description>DMAC Software Last Transfer Flag Register</description>
               <addressOffset>0x010</addressOffset>
               <fields>
                  <field>
                     <name>SLAST0</name>
                     <description>Source Last</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DLAST0</name>
                     <description>Destination Last</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SLAST1</name>
                     <description>Source Last</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DLAST1</name>
                     <description>Destination Last</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SLAST2</name>
                     <description>Source Last</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DLAST2</name>
                     <description>Destination Last</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SLAST3</name>
                     <description>Source Last</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DLAST3</name>
                     <description>Destination Last</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SLAST4</name>
                     <description>Source Last</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DLAST4</name>
                     <description>Destination Last</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SLAST5</name>
                     <description>Source Last</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DLAST5</name>
                     <description>Destination Last</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SLAST6</name>
                     <description>Source Last</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DLAST6</name>
                     <description>Destination Last</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SLAST7</name>
                     <description>Source Last</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DLAST7</name>
                     <description>Destination Last</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
