Ac6Embedded/svd-microchip/SAMA5D3/ATSAMA5D36.svd
            <register>
               <name>EBCIER</name>
               <description>DMAC Error, Chained Buffer Transfer Completed Interrupt and Buffer Transfer Completed Interrupt Enable Register</description>
               <addressOffset>0x018</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>BTC0</name>
                     <description>Buffer Transfer Completed [7:0]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BTC1</name>
                     <description>Buffer Transfer Completed [7:0]</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BTC2</name>
                     <description>Buffer Transfer Completed [7:0]</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BTC3</name>
                     <description>Buffer Transfer Completed [7:0]</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BTC4</name>
                     <description>Buffer Transfer Completed [7:0]</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BTC5</name>
                     <description>Buffer Transfer Completed [7:0]</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BTC6</name>
                     <description>Buffer Transfer Completed [7:0]</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BTC7</name>
                     <description>Buffer Transfer Completed [7:0]</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CBTC0</name>
                     <description>Chained Buffer Transfer Completed [7:0]</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CBTC1</name>
                     <description>Chained Buffer Transfer Completed [7:0]</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CBTC2</name>
                     <description>Chained Buffer Transfer Completed [7:0]</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CBTC3</name>
                     <description>Chained Buffer Transfer Completed [7:0]</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CBTC4</name>
                     <description>Chained Buffer Transfer Completed [7:0]</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CBTC5</name>
                     <description>Chained Buffer Transfer Completed [7:0]</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CBTC6</name>
                     <description>Chained Buffer Transfer Completed [7:0]</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CBTC7</name>
                     <description>Chained Buffer Transfer Completed [7:0]</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERR0</name>
                     <description>Access Error [7:0]</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERR1</name>
                     <description>Access Error [7:0]</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERR2</name>
                     <description>Access Error [7:0]</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERR3</name>
                     <description>Access Error [7:0]</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERR4</name>
                     <description>Access Error [7:0]</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERR5</name>
                     <description>Access Error [7:0]</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERR6</name>
                     <description>Access Error [7:0]</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERR7</name>
                     <description>Access Error [7:0]</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DICERR0</name>
                     <description>Descriptor Integrity Check Error [7:0]</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DICERR1</name>
                     <description>Descriptor Integrity Check Error [7:0]</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DICERR2</name>
                     <description>Descriptor Integrity Check Error [7:0]</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DICERR3</name>
                     <description>Descriptor Integrity Check Error [7:0]</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DICERR4</name>
                     <description>Descriptor Integrity Check Error [7:0]</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DICERR5</name>
                     <description>Descriptor Integrity Check Error [7:0]</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DICERR6</name>
                     <description>Descriptor Integrity Check Error [7:0]</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DICERR7</name>
                     <description>Descriptor Integrity Check Error [7:0]</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EBCIDR</name>
               <description>DMAC Error, Chained Buffer Transfer Completed Interrupt and Buffer Transfer Completed Interrupt Disable Register</description>
               <addressOffset>0x01C</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>BTC0</name>
                     <description>Buffer Transfer Completed [7:0]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BTC1</name>
                     <description>Buffer Transfer Completed [7:0]</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BTC2</name>
                     <description>Buffer Transfer Completed [7:0]</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BTC3</name>
                     <description>Buffer Transfer Completed [7:0]</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BTC4</name>
                     <description>Buffer Transfer Completed [7:0]</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BTC5</name>
                     <description>Buffer Transfer Completed [7:0]</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BTC6</name>
                     <description>Buffer Transfer Completed [7:0]</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BTC7</name>
                     <description>Buffer Transfer Completed [7:0]</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CBTC0</name>
                     <description>Chained Buffer Transfer Completed [7:0]</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CBTC1</name>
                     <description>Chained Buffer Transfer Completed [7:0]</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CBTC2</name>
                     <description>Chained Buffer Transfer Completed [7:0]</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CBTC3</name>
                     <description>Chained Buffer Transfer Completed [7:0]</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CBTC4</name>
                     <description>Chained Buffer Transfer Completed [7:0]</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CBTC5</name>
                     <description>Chained Buffer Transfer Completed [7:0]</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CBTC6</name>
                     <description>Chained Buffer Transfer Completed [7:0]</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CBTC7</name>
                     <description>Chained Buffer Transfer Completed [7:0]</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERR0</name>
                     <description>Access Error [7:0]</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERR1</name>
                     <description>Access Error [7:0]</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERR2</name>
                     <description>Access Error [7:0]</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERR3</name>
                     <description>Access Error [7:0]</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERR4</name>
                     <description>Access Error [7:0]</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERR5</name>
                     <description>Access Error [7:0]</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERR6</name>
                     <description>Access Error [7:0]</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERR7</name>
                     <description>Access Error [7:0]</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DICERR0</name>
                     <description>Descriptor Integrity Check Error [7:0]</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DICERR1</name>
                     <description>Descriptor Integrity Check Error [7:0]</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DICERR2</name>
                     <description>Descriptor Integrity Check Error [7:0]</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DICERR3</name>
                     <description>Descriptor Integrity Check Error [7:0]</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DICERR4</name>
                     <description>Descriptor Integrity Check Error [7:0]</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DICERR5</name>
                     <description>Descriptor Integrity Check Error [7:0]</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DICERR6</name>
                     <description>Descriptor Integrity Check Error [7:0]</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DICERR7</name>
                     <description>Descriptor Integrity Check Error [7:0]</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
