Ac6Embedded/svd-microchip/SAMA5D3/ATSAMA5D36.svd
            <register>
               <name>CHDR</name>
               <description>DMAC Channel Handler Disable Register</description>
               <addressOffset>0x02C</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DIS0</name>
                     <description>Disable [7:0]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIS1</name>
                     <description>Disable [7:0]</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIS2</name>
                     <description>Disable [7:0]</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIS3</name>
                     <description>Disable [7:0]</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIS4</name>
                     <description>Disable [7:0]</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIS5</name>
                     <description>Disable [7:0]</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIS6</name>
                     <description>Disable [7:0]</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIS7</name>
                     <description>Disable [7:0]</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RES0</name>
                     <description>Resume [7:0]</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RES1</name>
                     <description>Resume [7:0]</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RES2</name>
                     <description>Resume [7:0]</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RES3</name>
                     <description>Resume [7:0]</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RES4</name>
                     <description>Resume [7:0]</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RES5</name>
                     <description>Resume [7:0]</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RES6</name>
                     <description>Resume [7:0]</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RES7</name>
                     <description>Resume [7:0]</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CHSR</name>
               <description>DMAC Channel Handler Status Register</description>
               <addressOffset>0x030</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ENA0</name>
                     <description>Enable [7:0]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENA1</name>
                     <description>Enable [7:0]</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENA2</name>
                     <description>Enable [7:0]</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENA3</name>
                     <description>Enable [7:0]</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENA4</name>
                     <description>Enable [7:0]</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENA5</name>
                     <description>Enable [7:0]</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENA6</name>
                     <description>Enable [7:0]</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENA7</name>
                     <description>Enable [7:0]</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SUSP0</name>
                     <description>Suspend [7:0]</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SUSP1</name>
                     <description>Suspend [7:0]</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SUSP2</name>
                     <description>Suspend [7:0]</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SUSP3</name>
                     <description>Suspend [7:0]</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SUSP4</name>
                     <description>Suspend [7:0]</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SUSP5</name>
                     <description>Suspend [7:0]</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SUSP6</name>
                     <description>Suspend [7:0]</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SUSP7</name>
                     <description>Suspend [7:0]</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EMPT0</name>
                     <description>Empty [7:0]</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EMPT1</name>
                     <description>Empty [7:0]</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EMPT2</name>
                     <description>Empty [7:0]</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EMPT3</name>
                     <description>Empty [7:0]</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EMPT4</name>
                     <description>Empty [7:0]</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EMPT5</name>
                     <description>Empty [7:0]</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EMPT6</name>
                     <description>Empty [7:0]</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EMPT7</name>
                     <description>Empty [7:0]</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STAL0</name>
                     <description>Stalled [7:0]</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STAL1</name>
                     <description>Stalled [7:0]</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STAL2</name>
                     <description>Stalled [7:0]</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STAL3</name>
                     <description>Stalled [7:0]</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STAL4</name>
                     <description>Stalled [7:0]</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STAL5</name>
                     <description>Stalled [7:0]</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STAL6</name>
                     <description>Stalled [7:0]</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STAL7</name>
                     <description>Stalled [7:0]</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>8</dim>
               <dimIncrement>40</dimIncrement>
               <name>DMAC_CH_NUM[%s]</name>
               <description/>
               <addressOffset>0x3C</addressOffset>
               <register>
                  <name>SADDR</name>
                  <description>DMAC Channel Source Address Register</description>
                  <addressOffset>0x0</addressOffset>
                  <fields>
                     <field>
                        <name>SADDR</name>
                        <description>Channel x Source Address</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DADDR</name>
                  <description>DMAC Channel Destination Address Register</description>
                  <addressOffset>0x4</addressOffset>
                  <fields>
                     <field>
                        <name>DADDR</name>
                        <description>Channel x Destination Address</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DSCR</name>
                  <description>DMAC Channel Descriptor Address Register</description>
                  <addressOffset>0x8</addressOffset>
                  <fields>
                     <field>
                        <name>DSCR_IF</name>
                        <description>Descriptor Interface Selection</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>DSCR_IFSelect</name>
                           <enumeratedValue>
                              <name>AHB_IF0</name>
                              <description>The buffer transfer descriptor is fetched via AHB-Lite Interface 0 (first DMA Master Interface)</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>AHB_IF1</name>
                              <description>The buffer transfer descriptor is fetched via AHB-Lite Interface 1 (second DMA Master Interface)</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>AHB_IF2</name>
                              <description>The buffer transfer descriptor is fetched via AHB-Lite Interface 2 (third DMA Master Interface)</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DSCR</name>
                        <description>Buffer Transfer Descriptor Address</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>30</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CTRLA</name>
                  <description>DMAC Channel Control A Register</description>
                  <addressOffset>0xC</addressOffset>
                  <fields>
                     <field>
                        <name>BTSIZE</name>
                        <description>Buffer Transfer Size</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>SCSIZE</name>
                        <description>Source Chunk Transfer Size</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>3</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>SCSIZESelect</name>
                           <enumeratedValue>
                              <name>CHK_1</name>
                              <description>1 data transferred</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CHK_4</name>
                              <description>4 data transferred</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CHK_8</name>
                              <description>8 data transferred</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CHK_16</name>
                              <description>16 data transferred</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DCSIZE</name>
                        <description>Destination Chunk Transfer Size</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>3</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>DCSIZESelect</name>
                           <enumeratedValue>
                              <name>CHK_1</name>
                              <description>1 data transferred</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CHK_4</name>
                              <description>4 data transferred</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CHK_8</name>
                              <description>8 data transferred</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CHK_16</name>
                              <description>16 data transferred</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SRC_WIDTH</name>
                        <description>Transfer Width for the Source</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>SRC_WIDTHSelect</name>
                           <enumeratedValue>
                              <name>BYTE</name>
                              <description>The transfer size is set to 8-bit width</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HALF_WORD</name>
                              <description>The transfer size is set to 16-bit width</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>WORD</name>
                              <description>The transfer size is set to 32-bit width</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DWORD</name>
                              <description>The transfer size is set to 64-bit width</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DST_WIDTH</name>
                        <description>Transfer Width for the Destination</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>DST_WIDTHSelect</name>
                           <enumeratedValue>
                              <name>BYTE</name>
                              <description>The transfer size is set to 8-bit width</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HALF_WORD</name>
                              <description>The transfer size is set to 16-bit width</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>WORD</name>
                              <description>The transfer size is set to 32-bit width</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DWORD</name>
                              <description>The transfer size is set to 64-bit width</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DONE</name>
                        <description>Current Descriptor Stop Command and Transfer Completed Memory Indicator</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
