Ac6Embedded/svd-microchip/SAMA5D3/ATSAMA5D36.svd
               <register>
                  <name>CTRLB</name>
                  <description>DMAC Channel Control B Register</description>
                  <addressOffset>0x10</addressOffset>
                  <fields>
                     <field>
                        <name>SIF</name>
                        <description>Source Interface Selection Field</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>SIFSelect</name>
                           <enumeratedValue>
                              <name>AHB_IF0</name>
                              <description>The source transfer is done via AHB_Lite Interface 0 (first DMA Master Interface)</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>AHB_IF1</name>
                              <description>The source transfer is done via AHB_Lite Interface 1 (second DMA Master Interface)</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>AHB_IF2</name>
                              <description>The source transfer is done via AHB_Lite Interface 2 (third DMA Master Interface)</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DIF</name>
                        <description>Destination Interface Selection Field</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>DIFSelect</name>
                           <enumeratedValue>
                              <name>AHB_IF0</name>
                              <description>The destination transfer is done via AHB_Lite Interface 0 (first DMA Master Interface)</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>AHB_IF1</name>
                              <description>The destination transfer is done via AHB_Lite Interface 1 (second DMA Master Interface)</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>AHB_IF2</name>
                              <description>The destination transfer is done via AHB_Lite Interface 2 (third DMA Master Interface)</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SRC_PIP</name>
                        <description>Source Picture-in-Picture Mode</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>SRC_PIPSelect</name>
                           <enumeratedValue>
                              <name>DISABLE</name>
                              <description>Picture-in-Picture mode is disabled. The source data area is contiguous.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLE</name>
                              <description>Picture-in-Picture mode is enabled. When the source PIP counter reaches the programmable boundary, the address is automatically incremented by a user defined amount.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DST_PIP</name>
                        <description>Destination Picture-in-Picture Mode</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>DST_PIPSelect</name>
                           <enumeratedValue>
                              <name>DISABLE</name>
                              <description>Picture-in-Picture mode is disabled. The Destination data area is contiguous.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLE</name>
                              <description>Picture-in-Picture mode is enabled. When the Destination PIP counter reaches the programmable boundary the address is automatically incremented by a user-defined amount.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SRC_DSCR</name>
                        <description>Source Address Descriptor</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>SRC_DSCRSelect</name>
                           <enumeratedValue>
                              <name>FETCH_FROM_MEM</name>
                              <description>Source address is updated when the descriptor is fetched from the memory.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FETCH_DISABLE</name>
                              <description>Buffer Descriptor Fetch operation is disabled for the source.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DST_DSCR</name>
                        <description>Destination Address Descriptor</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>DST_DSCRSelect</name>
                           <enumeratedValue>
                              <name>FETCH_FROM_MEM</name>
                              <description>Destination address is updated when the descriptor is fetched from the memory.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FETCH_DISABLE</name>
                              <description>Buffer Descriptor Fetch operation is disabled for the destination.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>FC</name>
                        <description>Flow Control</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>FCSelect</name>
                           <enumeratedValue>
                              <name>MEM2MEM_DMA_FC</name>
                              <description>Memory-to-Memory Transfer DMAC is flow controller</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MEM2PER_DMA_FC</name>
                              <description>Memory-to-Peripheral Transfer DMAC is flow controller</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PER2MEM_DMA_FC</name>
                              <description>Peripheral-to-Memory Transfer DMAC is flow controller</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PER2PER_DMA_FC</name>
                              <description>Peripheral-to-Peripheral Transfer DMAC is flow controller</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SRC_INCR</name>
                        <description>Incrementing, Decrementing or Fixed Address for the Source</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>SRC_INCRSelect</name>
                           <enumeratedValue>
                              <name>INCREMENTING</name>
                              <description>The source address is incremented</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DECREMENTING</name>
                              <description>The source address is decremented</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FIXED</name>
                              <description>The source address remains unchanged</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DST_INCR</name>
                        <description>Incrementing, Decrementing or Fixed Address for the Destination</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>DST_INCRSelect</name>
                           <enumeratedValue>
                              <name>INCREMENTING</name>
                              <description>The destination address is incremented</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DECREMENTING</name>
                              <description>The destination address is decremented</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FIXED</name>
                              <description>The destination address remains unchanged</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>IEN</name>
                        <description>Interrupt Enable Not</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>AUTO</name>
                        <description>Automatic Multiple Buffer Transfer</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>AUTOSelect</name>
                           <enumeratedValue>
                              <name>DISABLE</name>
                              <description>Automatic multiple buffer transfer is disabled.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLE</name>
                              <description>Automatic multiple buffer transfer is enabled. This bit enables replay mode or contiguous mode when several buffers are transferred.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
