Ac6Embedded/svd-microchip/SAMA5D3/ATSAMA5D36.svd
               <register>
                  <name>CFG</name>
                  <description>DMAC Channel Configuration Register</description>
                  <addressOffset>0x14</addressOffset>
                  <fields>
                     <field>
                        <name>SRC_PER</name>
                        <description>Source with Peripheral identifier</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>DST_PER</name>
                        <description>Destination with Peripheral identifier</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>SRC_REP</name>
                        <description>Source Reloaded from Previous</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>SRC_REPSelect</name>
                           <enumeratedValue>
                              <name>CONTIGUOUS_ADDR</name>
                              <description>When automatic mode is activated, source address is contiguous between two buffers.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RELOAD_ADDR</name>
                              <description>When automatic mode is activated, the source address and the control register are reloaded from previous transfer.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SRC_H2SEL</name>
                        <description>Software or Hardware Selection for the Source</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>SRC_H2SELSelect</name>
                           <enumeratedValue>
                              <name>SW</name>
                              <description>Software handshaking interface is used to trigger a transfer request.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HW</name>
                              <description>Hardware handshaking interface is used to trigger a transfer request.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SRC_PER_MSB</name>
                        <description>SRC_PER Most Significant Bits</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>DST_REP</name>
                        <description>Destination Reloaded from Previous</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>DST_REPSelect</name>
                           <enumeratedValue>
                              <name>CONTIGUOUS_ADDR</name>
                              <description>When automatic mode is activated, destination address is contiguous between two buffers.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RELOAD_ADDR</name>
                              <description>When automatic mode is activated, the destination and the control register are reloaded from the pre-vious transfer.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DST_H2SEL</name>
                        <description>Software or Hardware Selection for the Destination</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>DST_H2SELSelect</name>
                           <enumeratedValue>
                              <name>SW</name>
                              <description>Software handshaking interface is used to trigger a transfer request.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HW</name>
                              <description>Hardware handshaking interface is used to trigger a transfer request.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DST_PER_MSB</name>
                        <description>DST_PER Most Significant Bits</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>SOD</name>
                        <description>Stop On Done</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>SODSelect</name>
                           <enumeratedValue>
                              <name>DISABLE</name>
                              <description>STOP ON DONE disabled, the descriptor fetch operation ignores the DMAC_CTRLAx.DONE bit.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLE</name>
                              <description>STOP ON DONE activated, the DMAC module is automatically disabled if DMAC_CTRLAx.DONE bit is set.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>LOCK_IF</name>
                        <description>Interface Lock</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>LOCK_IFSelect</name>
                           <enumeratedValue>
                              <name>DISABLE</name>
                              <description>Interface Lock capability is disabled</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLE</name>
                              <description>Interface Lock capability is enabled</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>LOCK_B</name>
                        <description>Bus Lock</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>LOCK_BSelect</name>
                           <enumeratedValue>
                              <name>DISABLE</name>
                              <description>AHB Bus Locking capability is disabled.</description>
                              <value>0</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>LOCK_IF_L</name>
                        <description>Master Interface Arbiter Lock</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>LOCK_IF_LSelect</name>
                           <enumeratedValue>
                              <name>CHUNK</name>
                              <description>The Master Interface Arbiter is locked by the channel x for a chunk transfer.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>BUFFER</name>
                              <description>The Master Interface Arbiter is locked by the channel x for a buffer transfer.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>AHB_PROT</name>
                        <description>AHB Protection</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                     <field>
                        <name>FIFOCFG</name>
                        <description>FIFO Configuration</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>FIFOCFGSelect</name>
                           <enumeratedValue>
                              <name>ALAP_CFG</name>
                              <description>The largest defined length AHB burst is performed on the destination AHB interface.</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HALF_CFG</name>
                              <description>When half FIFO size is available/filled, a source/destination request is serviced.</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ASAP_CFG</name>
                              <description>When there is enough space/data available to perform a single AHB access, then the request is serviced.</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>SPIP</name>
                  <description>DMAC Channel Source Picture-in-Picture Configuration Register</description>
                  <addressOffset>0x18</addressOffset>
                  <fields>
                     <field>
                        <name>SPIP_HOLE</name>
                        <description>Source Picture-in-Picture Hole</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>SPIP_BOUNDARY</name>
                        <description>Source Picture-in-Picture Boundary</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>10</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DPIP</name>
                  <description>DMAC Channel Destination Picture-in-Picture Configuration Register</description>
                  <addressOffset>0x1C</addressOffset>
                  <fields>
                     <field>
                        <name>DPIP_HOLE</name>
                        <description>Destination Picture-in-Picture Hole</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>DPIP_BOUNDARY</name>
                        <description>Destination Picture-in-Picture Boundary</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>10</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <register>
               <name>WPMR</name>
               <description>DMAC Write Protection Mode Register</description>
               <addressOffset>0x1E4</addressOffset>
               <fields>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protection Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.</description>
                           <value>0x444D41</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>WPSR</name>
               <description>DMAC Write Protection Status Register</description>
               <addressOffset>0x1E8</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>WPVS</name>
                     <description>Write Protection Violation Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPVSRC</name>
                     <description>Write Protection Violation Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
