Ac6Embedded/svd-microchip/SAMA5D3/ATSAMA5D36.svd
            <register>
               <name>IDR</name>
               <description>Interrupt Disable Register</description>
               <addressOffset>0x2C</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>MFD</name>
                     <description>Management Frame Done</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCOMP</name>
                     <description>Receive Complete</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXUBR</name>
                     <description>Receive Used Bit Read</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXUBR</name>
                     <description>Transmit Used Bit Read</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TUND</name>
                     <description>Ethernet Transmit Buffer Underrun</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RLE</name>
                     <description>Retry Limit Exceeded</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXERR</name>
                     <description>Transmit Error</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCOMP</name>
                     <description>Transmit Complete</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ROVR</name>
                     <description>Receive Overrun</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HRESP</name>
                     <description>Hresp Not OK</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PFR</name>
                     <description>Pause Frame Received</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PTZ</name>
                     <description>Pause Time Zero</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WOL</name>
                     <description>Wake-On-LAN</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IMR</name>
               <description>Interrupt Mask Register</description>
               <addressOffset>0x30</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MFD</name>
                     <description>Management Frame Done</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCOMP</name>
                     <description>Receive Complete</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXUBR</name>
                     <description>Receive Used Bit Read</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXUBR</name>
                     <description>Transmit Used Bit Read</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TUND</name>
                     <description>Ethernet Transmit Buffer Underrun</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RLE</name>
                     <description>Retry Limit Exceeded</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXERR</name>
                     <description>Transmit Error</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCOMP</name>
                     <description>Transmit Complete</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ROVR</name>
                     <description>Receive Overrun</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HRESP</name>
                     <description>Hresp Not OK</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PFR</name>
                     <description>Pause Frame Received</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PTZ</name>
                     <description>Pause Time Zero</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WOL</name>
                     <description>Wake-On-LAN</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MAN</name>
               <description>PHY Maintenance Register</description>
               <addressOffset>0x34</addressOffset>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>PHY Transmit or Receive Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>CODE</name>
                     <description>Must Be Two</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>REGA</name>
                     <description>PHY Register Address</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>PHYA</name>
                     <description>PHY Address</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>RW</name>
                     <description>PHY Read/Write Command</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SOF</name>
                     <description>Start of Frame</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PTR</name>
               <description>Pause Time Register</description>
               <addressOffset>0x38</addressOffset>
               <fields>
                  <field>
                     <name>PTIME</name>
                     <description>Pause Time</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PFR</name>
               <description>Pause Frames Received Register</description>
               <addressOffset>0x3C</addressOffset>
               <fields>
                  <field>
                     <name>FROK</name>
                     <description>Pause Frames Received OK</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FTO</name>
               <description>Frames Transmitted OK Register</description>
               <addressOffset>0x40</addressOffset>
               <fields>
                  <field>
                     <name>FTOK</name>
                     <description>Frames Transmitted OK</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCF</name>
               <description>Single Collision Frames Register</description>
               <addressOffset>0x44</addressOffset>
               <fields>
                  <field>
                     <name>SCF</name>
                     <description>Single Collision Frames</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MCF</name>
               <description>Multiple Collision Frames Register</description>
               <addressOffset>0x48</addressOffset>
               <fields>
                  <field>
                     <name>MCF</name>
                     <description>Multicollision Frames</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FRO</name>
               <description>Frames Received OK Register</description>
               <addressOffset>0x4C</addressOffset>
               <fields>
                  <field>
                     <name>FROK</name>
                     <description>Frames Received OK</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FCSE</name>
               <description>Frame Check Sequence Errors Register</description>
               <addressOffset>0x50</addressOffset>
               <fields>
                  <field>
                     <name>FCSE</name>
                     <description>Frame Check Sequence Errors</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ALE</name>
               <description>Alignment Errors Register</description>
               <addressOffset>0x54</addressOffset>
               <fields>
                  <field>
                     <name>ALE</name>
                     <description>Alignment Errors</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DTF</name>
               <description>Deferred Transmission Frames Register</description>
               <addressOffset>0x58</addressOffset>
               <fields>
                  <field>
                     <name>DTF</name>
                     <description>Deferred Transmission Frames</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LCOL</name>
               <description>Late Collisions Register</description>
               <addressOffset>0x5C</addressOffset>
               <fields>
                  <field>
                     <name>LCOL</name>
                     <description>Late Collisions</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ECOL</name>
               <description>Excessive Collisions Register</description>
               <addressOffset>0x60</addressOffset>
               <fields>
                  <field>
                     <name>EXCOL</name>
                     <description>Excessive Collisions</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TUND</name>
               <description>Transmit Underrun Errors Register</description>
               <addressOffset>0x64</addressOffset>
               <fields>
                  <field>
                     <name>TUND</name>
                     <description>Transmit Underruns</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSE</name>
               <description>Carrier Sense Errors Register</description>
               <addressOffset>0x68</addressOffset>
               <fields>
                  <field>
                     <name>CSE</name>
                     <description>Carrier Sense Errors</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RRE</name>
               <description>Receive Resource Errors Register</description>
               <addressOffset>0x6C</addressOffset>
               <fields>
                  <field>
                     <name>RRE</name>
                     <description>Receive Resource Errors</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ROV</name>
               <description>Receive Overrun Errors Register</description>
               <addressOffset>0x70</addressOffset>
               <fields>
                  <field>
                     <name>ROVR</name>
                     <description>Receive Overrun</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RSE</name>
               <description>Receive Symbol Errors Register</description>
               <addressOffset>0x74</addressOffset>
               <fields>
                  <field>
                     <name>RSE</name>
                     <description>Receive Symbol Errors</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ELE</name>
               <description>Excessive Length Errors Register</description>
               <addressOffset>0x78</addressOffset>
               <fields>
                  <field>
                     <name>EXL</name>
                     <description>Excessive Length Errors</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RJA</name>
               <description>Receive Jabbers Register</description>
               <addressOffset>0x7C</addressOffset>
               <fields>
                  <field>
                     <name>RJB</name>
                     <description>Receive Jabbers</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>USF</name>
               <description>Undersize Frames Register</description>
               <addressOffset>0x80</addressOffset>
               <fields>
                  <field>
                     <name>USF</name>
                     <description>Undersize Frames</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STE</name>
               <description>SQE Test Errors Register</description>
               <addressOffset>0x84</addressOffset>
               <fields>
                  <field>
                     <name>SQER</name>
                     <description>SQE Test Errors</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RLE</name>
               <description>Received Length Field Mismatch Register</description>
               <addressOffset>0x88</addressOffset>
               <fields>
                  <field>
                     <name>RLFM</name>
                     <description>Receive Length Field Mismatch</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HRB</name>
               <description>Hash Register Bottom [31:0] Register</description>
               <addressOffset>0x90</addressOffset>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Hash Address Bottom</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HRT</name>
               <description>Hash Register Top [63:32] Register</description>
               <addressOffset>0x94</addressOffset>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Hash Address Top</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>4</dim>
               <dimIncrement>8</dimIncrement>
               <name>EMAC_SA[%s]</name>
               <description/>
               <addressOffset>0x98</addressOffset>
               <register>
                  <name>SAxB</name>
                  <description>Specific Address X Bottom Register</description>
                  <addressOffset>0x0</addressOffset>
                  <fields>
                     <field>
                        <name>ADDR</name>
                        <description>Specific Address X Bottom</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>SAxT</name>
                  <description>Specific Address X Top Register</description>
                  <addressOffset>0x4</addressOffset>
                  <fields>
                     <field>
                        <name>ADDR</name>
                        <description>Specific Address X Top</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <register>
               <name>TID</name>
               <description>Type ID Checking Register</description>
               <addressOffset>0xB8</addressOffset>
               <fields>
                  <field>
                     <name>TID</name>
                     <description>Type ID Checking</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>USRIO</name>
               <description>User Input/Output Register</description>
               <addressOffset>0xC0</addressOffset>
               <fields>
                  <field>
                     <name>RMII</name>
                     <description>Reduced MII</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLKEN</name>
                     <description>Clock Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
