Ac6Embedded/svd-microchip/SAMA5D3/ATSAMA5D36.svd
            <register>
               <name>WOL</name>
               <description>Wake-on-LAN Register</description>
               <addressOffset>0xC4</addressOffset>
               <fields>
                  <field>
                     <name>IP</name>
                     <description>ARP Request IP Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>MAG</name>
                     <description>Magic Packet Event Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ARP</name>
                     <description>ARP Request IP Address</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SA1</name>
                     <description>Specific Address Register 1 Event Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MTI</name>
                     <description>Multicast Hash Event Enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>FUSE</name>
         <version>11094E</version>
         <description>Fuse Controller</description>
         <baseAddress>0xFFFFE400</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x30</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>FUSE</name>
            <description>Fuse Controller</description>
            <value>48</value>
         </interrupt>
         <registers>
            <register>
               <name>CR</name>
               <description>Fuse Control Register</description>
               <addressOffset>0x00</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>WRQ</name>
                     <description>Write Request</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RRQ</name>
                     <description>Read Request</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>KEY</name>
                     <description>Key code</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>KEYSelect</name>
                        <enumeratedValue>
                           <name>VALID</name>
                           <description>Writing any other value in this field aborts the write operation of the WRQ and RRQ bits.Always reads as 0.</description>
                           <value>0xFB</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>MR</name>
               <description>Fuse Mode Register</description>
               <addressOffset>0x04</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>MSK</name>
                     <description>Mask Fuse Status Registers</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IR</name>
               <description>Fuse Index Register</description>
               <addressOffset>0x08</addressOffset>
               <fields>
                  <field>
                     <name>WS</name>
                     <description>Write Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RS</name>
                     <description>Read Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WSEL</name>
                     <description>Word Selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DR</name>
               <description>Fuse Data Register</description>
               <addressOffset>0x0C</addressOffset>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>Data to Program</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>SR[%s]</name>
               <description>Fuse Status Register</description>
               <addressOffset>0x10</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>FUSE</name>
                     <description>Fuse Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
