Ac6Embedded/svd-microchip/SAMA5D3/ATSAMA5D36.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>GPBR</name>
         <version>6378H</version>
         <description>General Purpose Backup Registers</description>
         <baseAddress>0xFFFFFE60</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x10</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>SYS_GPBR[%s]</name>
               <description>General Purpose Backup Register</description>
               <addressOffset>0x0</addressOffset>
               <fields>
                  <field>
                     <name>GPBR_VALUE</name>
                     <description>Value of GPBR x</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>HSMCI0</name>
         <version>6449Q</version>
         <description>High Speed MultiMedia Card Interface</description>
         <groupName>HSMCI</groupName>
         <prependToName>HSMCI_</prependToName>
         <baseAddress>0xF0000000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x600</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>HSMCI0</name>
            <description>High Speed Multimedia Card Interface 0</description>
            <value>21</value>
         </interrupt>
         <registers>
            <register>
               <name>CR</name>
               <description>Control Register</description>
               <addressOffset>0x00</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>MCIEN</name>
                     <description>Multi-Media Interface Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCIDIS</name>
                     <description>Multi-Media Interface Disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWSEN</name>
                     <description>Power Save Mode Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWSDIS</name>
                     <description>Power Save Mode Disable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MR</name>
               <description>Mode Register</description>
               <addressOffset>0x04</addressOffset>
               <fields>
                  <field>
                     <name>CLKDIV</name>
                     <description>Clock Divider</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PWSDIV</name>
                     <description>Power Saving Divider</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>RDPROOF</name>
                     <description>Read Proof Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRPROOF</name>
                     <description>Write Proof Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FBYTE</name>
                     <description>Force Byte Transfer</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PADV</name>
                     <description>Padding Value</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLKODD</name>
                     <description>Clock divider is odd</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DTOR</name>
               <description>Data Timeout Register</description>
               <addressOffset>0x08</addressOffset>
               <fields>
                  <field>
                     <name>DTOCYC</name>
                     <description>Data Timeout Cycle Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DTOMUL</name>
                     <description>Data Timeout Multiplier</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>DTOMULSelect</name>
                        <enumeratedValue>
                           <name>_1</name>
                           <description>DTOCYC</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16</name>
                           <description>DTOCYC x 16</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_128</name>
                           <description>DTOCYC x 128</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_256</name>
                           <description>DTOCYC x 256</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1024</name>
                           <description>DTOCYC x 1024</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_4096</name>
                           <description>DTOCYC x 4096</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_65536</name>
                           <description>DTOCYC x 65536</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1048576</name>
                           <description>DTOCYC x 1048576</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SDCR</name>
               <description>SD/SDIO Card Register</description>
               <addressOffset>0x0C</addressOffset>
               <fields>
                  <field>
                     <name>SDCSEL</name>
                     <description>SDCard/SDIO Slot</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>SDCSELSelect</name>
                        <enumeratedValue>
                           <name>SLOTA</name>
                           <description>Slot A is selected.</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SDCBUS</name>
                     <description>SDCard/SDIO Bus Width</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>SDCBUSSelect</name>
                        <enumeratedValue>
                           <name>_1</name>
                           <description>1 bit</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_4</name>
                           <description>4 bits</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_8</name>
                           <description>8 bits</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ARGR</name>
               <description>Argument Register</description>
               <addressOffset>0x10</addressOffset>
               <fields>
                  <field>
                     <name>ARG</name>
                     <description>Command Argument</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
