Ac6Embedded/svd-microchip/SAMA5D3/ATSAMA5D36.svd
            <register>
               <name>OVR1CFG9</name>
               <description>Overlay 1 Configuration Register 9</description>
               <addressOffset>0x00000190</addressOffset>
               <fields>
                  <field>
                     <name>CRKEY</name>
                     <description>Blender Chroma Key Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INV</name>
                     <description>Blender Inverted Blender Output Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ITER2BL</name>
                     <description>Blender Iterated Color Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ITER</name>
                     <description>Blender Use Iterated Color</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REVALPHA</name>
                     <description>Blender Reverse Alpha</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GAEN</name>
                     <description>Blender Global Alpha Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAEN</name>
                     <description>Blender Local Alpha Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR</name>
                     <description>Blender Overlay Layer Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA</name>
                     <description>Blender DMA Layer Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REP</name>
                     <description>Use Replication logic to expand RGB color to 24 bits</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSTKEY</name>
                     <description>Destination Chroma Keying</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GA</name>
                     <description>Blender Global Alpha</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVR2CHER</name>
               <description>Overlay 2 Channel Enable Register</description>
               <addressOffset>0x00000240</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>CHEN</name>
                     <description>Channel Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UPDATEEN</name>
                     <description>Update Overlay Attributes Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>A2QEN</name>
                     <description>Add To Queue Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVR2CHDR</name>
               <description>Overlay 2 Channel Disable Register</description>
               <addressOffset>0x00000244</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>CHDIS</name>
                     <description>Channel Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHRST</name>
                     <description>Channel Reset</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVR2CHSR</name>
               <description>Overlay 2 Channel Status Register</description>
               <addressOffset>0x00000248</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CHSR</name>
                     <description>Channel Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UPDATESR</name>
                     <description>Update Overlay Attributes In Progress Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>A2QSR</name>
                     <description>Add To Queue Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVR2IER</name>
               <description>Overlay 2 Interrupt Enable Register</description>
               <addressOffset>0x0000024C</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DMA</name>
                     <description>End of DMA Transfer Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSCR</name>
                     <description>Descriptor Loaded Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADD</name>
                     <description>Head Descriptor Loaded Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DONE</name>
                     <description>End of List Interrupt Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR</name>
                     <description>Overflow Interrupt Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVR2IDR</name>
               <description>Overlay 2 Interrupt Disable Register</description>
               <addressOffset>0x00000250</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DMA</name>
                     <description>End of DMA Transfer Interrupt Disable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSCR</name>
                     <description>Descriptor Loaded Interrupt Disable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADD</name>
                     <description>Head Descriptor Loaded Interrupt Disable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DONE</name>
                     <description>End of List Interrupt Disable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR</name>
                     <description>Overflow Interrupt Disable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVR2IMR</name>
               <description>Overlay 2 Interrupt Mask Register</description>
               <addressOffset>0x00000254</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DMA</name>
                     <description>End of DMA Transfer Interrupt Mask</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSCR</name>
                     <description>Descriptor Loaded Interrupt Mask</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADD</name>
                     <description>Head Descriptor Loaded Interrupt Mask</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DONE</name>
                     <description>End of List Interrupt Mask</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR</name>
                     <description>Overflow Interrupt Mask</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVR2ISR</name>
               <description>Overlay 2 Interrupt Status Register</description>
               <addressOffset>0x00000258</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DMA</name>
                     <description>End of DMA Transfer</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSCR</name>
                     <description>DMA Descriptor Loaded</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADD</name>
                     <description>Head Descriptor Loaded</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DONE</name>
                     <description>End of List Detected</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR</name>
                     <description>Overflow Detected</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVR2HEAD</name>
               <description>Overlay 2 DMA Head Register</description>
               <addressOffset>0x0000025C</addressOffset>
               <fields>
                  <field>
                     <name>HEAD</name>
                     <description>DMA Head Pointer</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>30</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVR2ADDR</name>
               <description>Overlay 2 DMA Address Register</description>
               <addressOffset>0x00000260</addressOffset>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>DMA Transfer Overlay 2 Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVR2CTRL</name>
               <description>Overlay 2 DMA Control Register</description>
               <addressOffset>0x00000264</addressOffset>
               <fields>
                  <field>
                     <name>DFETCH</name>
                     <description>Transfer Descriptor Fetch Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LFETCH</name>
                     <description>Lookup Table Fetch Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAIEN</name>
                     <description>End of DMA Transfer Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSCRIEN</name>
                     <description>Descriptor Loaded Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADDIEN</name>
                     <description>Add Head Descriptor to Queue Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DONEIEN</name>
                     <description>End of List Interrupt Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVR2NEXT</name>
               <description>Overlay 2 DMA Next Register</description>
               <addressOffset>0x00000268</addressOffset>
               <fields>
                  <field>
                     <name>NEXT</name>
                     <description>DMA Descriptor Next Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVR2CFG0</name>
               <description>Overlay 2 Configuration Register 0</description>
               <addressOffset>0x0000026C</addressOffset>
               <fields>
                  <field>
                     <name>BLEN</name>
                     <description>AHB Burst Length</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>BLENSelect</name>
                        <enumeratedValue>
                           <name>AHB_SINGLE</name>
                           <description>AHB Access is started as soon as there is enough space in the FIFO to store one data. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AHB_INCR4</name>
                           <description>AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 4 data. An AHB INCR4 Burst is used. SINGLE, INCR and INCR4 bursts are used. INCR is used for a burst of 2 and 3 beats.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AHB_INCR8</name>
                           <description>AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 8 data. An AHB INCR8 Burst is used. SINGLE, INCR, INCR4 and INCR8 bursts are used. INCR is used for a burst of 2 and 3 beats.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AHB_INCR16</name>
                           <description>AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 16 data. An AHB INCR16 Burst is used. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DLBO</name>
                     <description>Defined Length Burst Only For Channel Bus Transaction</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ROTDIS</name>
                     <description>Hardware Rotation Optimization Disable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCKDIS</name>
                     <description>Hardware Rotation Lock Disable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
