Ac6Embedded/svd-microchip/SAMA5D3/ATSAMA5D36.svd
            <register>
               <name>OVR2CFG1</name>
               <description>Overlay 2 Configuration Register 1</description>
               <addressOffset>0x00000270</addressOffset>
               <fields>
                  <field>
                     <name>CLUTEN</name>
                     <description>Color Lookup Table Mode Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RGBMODE</name>
                     <description>RGB Mode Input Selection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>RGBMODESelect</name>
                        <enumeratedValue>
                           <name>_12BPP_RGB_444</name>
                           <description>12 bpp RGB 444</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16BPP_ARGB_4444</name>
                           <description>16 bpp ARGB 4444</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16BPP_RGBA_4444</name>
                           <description>16 bpp RGBA 4444</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16BPP_RGB_565</name>
                           <description>16 bpp RGB 565</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16BPP_TRGB_1555</name>
                           <description>16 bpp TRGB 1555</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_18BPP_RGB_666</name>
                           <description>18 bpp RGB 666</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_18BPP_RGB_666PACKED</name>
                           <description>18 bpp RGB 666 PACKED</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_19BPP_TRGB_1666</name>
                           <description>19 bpp TRGB 1666</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_19BPP_TRGB_PACKED</name>
                           <description>19 bpp TRGB 1666 PACKED</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_24BPP_RGB_888</name>
                           <description>24 bpp RGB 888</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_24BPP_RGB_888_PACKED</name>
                           <description>24 bpp RGB 888 PACKED</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_25BPP_TRGB_1888</name>
                           <description>25 bpp TRGB 1888</description>
                           <value>0xB</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32BPP_ARGB_8888</name>
                           <description>32 bpp ARGB 8888</description>
                           <value>0xC</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32BPP_RGBA_8888</name>
                           <description>32 bpp RGBA 8888</description>
                           <value>0xD</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLUTMODE</name>
                     <description>Color Lookup Table Mode Input Selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>CLUTMODESelect</name>
                        <enumeratedValue>
                           <name>CLUT_1BPP</name>
                           <description>Color Lookup Table mode set to 1 bit per pixel</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLUT_2BPP</name>
                           <description>Color Lookup Table mode set to 2 bits per pixel</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLUT_4BPP</name>
                           <description>Color Lookup Table mode set to 4 bits per pixel</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLUT_8BPP</name>
                           <description>Color Lookup Table mode set to 8 bits per pixel</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVR2CFG2</name>
               <description>Overlay 2 Configuration Register 2</description>
               <addressOffset>0x00000274</addressOffset>
               <fields>
                  <field>
                     <name>XPOS</name>
                     <description>Horizontal Window Position</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>YPOS</name>
                     <description>Vertical Window Position</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVR2CFG3</name>
               <description>Overlay 2 Configuration Register 3</description>
               <addressOffset>0x00000278</addressOffset>
               <fields>
                  <field>
                     <name>XSIZE</name>
                     <description>Horizontal Window Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>YSIZE</name>
                     <description>Vertical Window Size</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVR2CFG4</name>
               <description>Overlay 2 Configuration Register 4</description>
               <addressOffset>0x0000027C</addressOffset>
               <fields>
                  <field>
                     <name>XSTRIDE</name>
                     <description>Horizontal Stride</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVR2CFG5</name>
               <description>Overlay 2 Configuration Register 5</description>
               <addressOffset>0x00000280</addressOffset>
               <fields>
                  <field>
                     <name>PSTRIDE</name>
                     <description>Pixel Stride</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVR2CFG6</name>
               <description>Overlay 2 Configuration Register 6</description>
               <addressOffset>0x00000284</addressOffset>
               <fields>
                  <field>
                     <name>BDEF</name>
                     <description>Blue Default</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>GDEF</name>
                     <description>Green Default</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RDEF</name>
                     <description>Red Default</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVR2CFG7</name>
               <description>Overlay 2 Configuration Register 7</description>
               <addressOffset>0x00000288</addressOffset>
               <fields>
                  <field>
                     <name>BKEY</name>
                     <description>Blue Color Component Chroma Key</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>GKEY</name>
                     <description>Green Color Component Chroma Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RKEY</name>
                     <description>Red Color Component Chroma Key</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVR2CFG8</name>
               <description>Overlay 2 Configuration Register 8</description>
               <addressOffset>0x0000028C</addressOffset>
               <fields>
                  <field>
                     <name>BMASK</name>
                     <description>Blue Color Component Chroma Key Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>GMASK</name>
                     <description>Green Color Component Chroma Key Mask</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RMASK</name>
                     <description>Red Color Component Chroma Key Mask</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVR2CFG9</name>
               <description>Overlay 2 Configuration Register 8</description>
               <addressOffset>0x00000290</addressOffset>
               <fields>
                  <field>
                     <name>CRKEY</name>
                     <description>Blender Chroma Key Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INV</name>
                     <description>Blender Inverted Blender Output Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ITER2BL</name>
                     <description>Blender Iterated Color Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ITER</name>
                     <description>Blender Use Iterated Color</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REVALPHA</name>
                     <description>Blender Reverse Alpha</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GAEN</name>
                     <description>Blender Global Alpha Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAEN</name>
                     <description>Blender Local Alpha Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR</name>
                     <description>Blender Overlay Layer Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA</name>
                     <description>Blender DMA Layer Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REP</name>
                     <description>Use Replication logic to expand RGB color to 24 bits</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSTKEY</name>
                     <description>Destination Chroma Keying</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GA</name>
                     <description>Blender Global Alpha</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOCHER</name>
               <description>High End Overlay Channel Enable Register</description>
               <addressOffset>0x00000340</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>CHEN</name>
                     <description>Channel Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UPDATEEN</name>
                     <description>Update Overlay Attributes Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>A2QEN</name>
                     <description>Add To Queue Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOCHDR</name>
               <description>High End Overlay Channel Disable Register</description>
               <addressOffset>0x00000344</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>CHDIS</name>
                     <description>Channel Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHRST</name>
                     <description>Channel Reset</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOCHSR</name>
               <description>High End Overlay Channel Status Register</description>
               <addressOffset>0x00000348</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CHSR</name>
                     <description>Channel Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UPDATESR</name>
                     <description>Update Overlay Attributes In Progress Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>A2QSR</name>
                     <description>Add To Queue Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOIER</name>
               <description>High End Overlay Interrupt Enable Register</description>
               <addressOffset>0x0000034C</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DMA</name>
                     <description>End of DMA Transfer Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSCR</name>
                     <description>Descriptor Loaded Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADD</name>
                     <description>Head Descriptor Loaded Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DONE</name>
                     <description>End of List Interrupt Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR</name>
                     <description>Overflow Interrupt Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UDMA</name>
                     <description>End of DMA Transfer for U or UV Chrominance Interrupt Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UDSCR</name>
                     <description>Descriptor Loaded for U or UV Chrominance Interrupt Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UADD</name>
                     <description>Head Descriptor Loaded for U or UV Chrominance Interrupt Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UDONE</name>
                     <description>End of List for U or UV Chrominance Interrupt Enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UOVR</name>
                     <description>Overflow for U or UV Chrominance Interrupt Enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VDMA</name>
                     <description>End of DMA for V Chrominance Transfer Interrupt Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VDSCR</name>
                     <description>Descriptor Loaded for V Chrominance Interrupt Enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VADD</name>
                     <description>Head Descriptor Loaded for V Chrominance Interrupt Enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VDONE</name>
                     <description>End of List for V Chrominance Interrupt Enable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VOVR</name>
                     <description>Overflow for V Chrominance Interrupt Enable</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
