Ac6Embedded/svd-microchip/SAMA5D3/ATSAMA5D36.svd
            <register>
               <name>HEOIDR</name>
               <description>High End Overlay Interrupt Disable Register</description>
               <addressOffset>0x00000350</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DMA</name>
                     <description>End of DMA Transfer Interrupt Disable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSCR</name>
                     <description>Descriptor Loaded Interrupt Disable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADD</name>
                     <description>Head Descriptor Loaded Interrupt Disable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DONE</name>
                     <description>End of List Interrupt Disable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR</name>
                     <description>Overflow Interrupt Disable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UDMA</name>
                     <description>End of DMA Transfer for U or UV Chrominance Component Interrupt Disable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UDSCR</name>
                     <description>Descriptor Loaded for U or UV Chrominance Component Interrupt Disable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UADD</name>
                     <description>Head Descriptor Loaded for U or UV Chrominance Component Interrupt Disable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UDONE</name>
                     <description>End of List Interrupt for U or UV Chrominance Component Disable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UOVR</name>
                     <description>Overflow Interrupt for U or UV Chrominance Component Disable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VDMA</name>
                     <description>End of DMA Transfer for V Chrominance Component Interrupt Disable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VDSCR</name>
                     <description>Descriptor Loaded for V Chrominance Component Interrupt Disable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VADD</name>
                     <description>Head Descriptor Loaded for V Chrominance Component Interrupt Disable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VDONE</name>
                     <description>End of List for V Chrominance Component Interrupt Disable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VOVR</name>
                     <description>Overflow for V Chrominance Component Interrupt Disable</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOIMR</name>
               <description>High End Overlay Interrupt Mask Register</description>
               <addressOffset>0x00000354</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DMA</name>
                     <description>End of DMA Transfer Interrupt Mask</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSCR</name>
                     <description>Descriptor Loaded Interrupt Mask</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADD</name>
                     <description>Head Descriptor Loaded Interrupt Mask</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DONE</name>
                     <description>End of List Interrupt Mask</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR</name>
                     <description>Overflow Interrupt Mask</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UDMA</name>
                     <description>End of DMA Transfer for U or UV Chrominance Component Interrupt Mask</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UDSCR</name>
                     <description>Descriptor Loaded for U or UV Chrominance Component Interrupt Mask</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UADD</name>
                     <description>Head Descriptor Loaded for U or UV Chrominance Component Mask</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UDONE</name>
                     <description>End of List for U or UV Chrominance Component Mask</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UOVR</name>
                     <description>Overflow for U Chrominance Interrupt Mask</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VDMA</name>
                     <description>End of DMA Transfer for V Chrominance Component Interrupt Mask</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VDSCR</name>
                     <description>Descriptor Loaded for V Chrominance Component Interrupt Mask</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VADD</name>
                     <description>Head Descriptor Loaded for V Chrominance Component Mask</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VDONE</name>
                     <description>End of List for V Chrominance Component Mask</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VOVR</name>
                     <description>Overflow for V Chrominance Interrupt Mask</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOISR</name>
               <description>High End Overlay Interrupt Status Register</description>
               <addressOffset>0x00000358</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DMA</name>
                     <description>End of DMA Transfer</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSCR</name>
                     <description>DMA Descriptor Loaded</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADD</name>
                     <description>Head Descriptor Loaded</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DONE</name>
                     <description>End of List Detected</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR</name>
                     <description>Overflow Detected</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UDMA</name>
                     <description>End of DMA Transfer for U Component</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UDSCR</name>
                     <description>DMA Descriptor Loaded for U Component</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UADD</name>
                     <description>Head Descriptor Loaded for U Component</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UDONE</name>
                     <description>End of List Detected for U Component</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UOVR</name>
                     <description>Overflow Detected for U Component</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VDMA</name>
                     <description>End of DMA Transfer for V Component</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VDSCR</name>
                     <description>DMA Descriptor Loaded for V Component</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VADD</name>
                     <description>Head Descriptor Loaded for V Component</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VDONE</name>
                     <description>End of List Detected for V Component</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VOVR</name>
                     <description>Overflow Detected for V Component</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOHEAD</name>
               <description>High End Overlay DMA Head Register</description>
               <addressOffset>0x0000035C</addressOffset>
               <fields>
                  <field>
                     <name>HEAD</name>
                     <description>DMA Head Pointer</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>30</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOADDR</name>
               <description>High End Overlay DMA Address Register</description>
               <addressOffset>0x00000360</addressOffset>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>DMA Transfer Start Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOCTRL</name>
               <description>High End Overlay DMA Control Register</description>
               <addressOffset>0x00000364</addressOffset>
               <fields>
                  <field>
                     <name>DFETCH</name>
                     <description>Transfer Descriptor Fetch Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LFETCH</name>
                     <description>Lookup Table Fetch Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAIEN</name>
                     <description>End of DMA Transfer Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSCRIEN</name>
                     <description>Descriptor Loaded Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADDIEN</name>
                     <description>Add Head Descriptor to Queue Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DONEIEN</name>
                     <description>End of List Interrupt Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEONEXT</name>
               <description>High End Overlay DMA Next Register</description>
               <addressOffset>0x00000368</addressOffset>
               <fields>
                  <field>
                     <name>NEXT</name>
                     <description>DMA Descriptor Next Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOUHEAD</name>
               <description>High End Overlay U-UV DMA Head Register</description>
               <addressOffset>0x0000036C</addressOffset>
               <fields>
                  <field>
                     <name>UHEAD</name>
                     <description>DMA Head Pointer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOUADDR</name>
               <description>High End Overlay U-UV DMA Address Register</description>
               <addressOffset>0x00000370</addressOffset>
               <fields>
                  <field>
                     <name>UADDR</name>
                     <description>DMA Transfer Start Address for U or UV Chrominance</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOUCTRL</name>
               <description>High End Overlay U-UV DMA Control Register</description>
               <addressOffset>0x00000374</addressOffset>
               <fields>
                  <field>
                     <name>UDFETCH</name>
                     <description>Transfer Descriptor Fetch Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UDMAIEN</name>
                     <description>End of DMA Transfer Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UDSCRIEN</name>
                     <description>Descriptor Loaded Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UADDIEN</name>
                     <description>Add Head Descriptor to Queue Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UDONEIEN</name>
                     <description>End of List Interrupt Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOUNEXT</name>
               <description>High End Overlay U-UV DMA Next Register</description>
               <addressOffset>0x00000378</addressOffset>
               <fields>
                  <field>
                     <name>UNEXT</name>
                     <description>DMA Descriptor Next Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOVHEAD</name>
               <description>High End Overlay V DMA Head Register</description>
               <addressOffset>0x0000037C</addressOffset>
               <fields>
                  <field>
                     <name>VHEAD</name>
                     <description>DMA Head Pointer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOVADDR</name>
               <description>High End Overlay V DMA Address Register</description>
               <addressOffset>0x00000380</addressOffset>
               <fields>
                  <field>
                     <name>VADDR</name>
                     <description>DMA Transfer Start Address for V Chrominance</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOVCTRL</name>
               <description>High End Overlay V DMA Control Register</description>
               <addressOffset>0x00000384</addressOffset>
               <fields>
                  <field>
                     <name>VDFETCH</name>
                     <description>Transfer Descriptor Fetch Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VDMAIEN</name>
                     <description>End of DMA Transfer Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VDSCRIEN</name>
                     <description>Descriptor Loaded Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VADDIEN</name>
                     <description>Add Head Descriptor to Queue Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VDONEIEN</name>
                     <description>End of List Interrupt Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOVNEXT</name>
               <description>High End Overlay V DMA Next Register</description>
               <addressOffset>0x00000388</addressOffset>
               <fields>
                  <field>
                     <name>VNEXT</name>
                     <description>DMA Descriptor Next Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
