Ac6Embedded/svd-microchip/SAMA5D3/ATSAMA5D36.svd
            <register>
               <name>HEOCFG11</name>
               <description>High End Overlay Configuration Register 11</description>
               <addressOffset>0x000003B8</addressOffset>
               <fields>
                  <field>
                     <name>BMASK</name>
                     <description>Blue Color Component Chroma Key Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>GMASK</name>
                     <description>Green Color Component Chroma Key Mask</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RMASK</name>
                     <description>Red Color Component Chroma Key Mask</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOCFG12</name>
               <description>High End Overlay Configuration Register 12</description>
               <addressOffset>0x000003BC</addressOffset>
               <fields>
                  <field>
                     <name>CRKEY</name>
                     <description>Blender Chroma Key Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INV</name>
                     <description>Blender Inverted Blender Output Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ITER2BL</name>
                     <description>Blender Iterated Color Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ITER</name>
                     <description>Blender Use Iterated Color</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REVALPHA</name>
                     <description>Blender Reverse Alpha</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GAEN</name>
                     <description>Blender Global Alpha Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAEN</name>
                     <description>Blender Local Alpha Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR</name>
                     <description>Blender Overlay Layer Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA</name>
                     <description>Blender DMA Layer Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REP</name>
                     <description>Use Replication logic to expand RGB color to 24 bits</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSTKEY</name>
                     <description>Destination Chroma Keying</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VIDPRI</name>
                     <description>Video Priority</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GA</name>
                     <description>Blender Global Alpha</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOCFG13</name>
               <description>High End Overlay Configuration Register 13</description>
               <addressOffset>0x000003C0</addressOffset>
               <fields>
                  <field>
                     <name>XFACTOR</name>
                     <description>Horizontal Scaling Factor</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
                  <field>
                     <name>YFACTOR</name>
                     <description>Vertical Scaling Factor</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
                  <field>
                     <name>SCALEN</name>
                     <description>Hardware Scaler Enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOCFG14</name>
               <description>High End Overlay Configuration Register 14</description>
               <addressOffset>0x000003C4</addressOffset>
               <fields>
                  <field>
                     <name>CSCRY</name>
                     <description>Color Space Conversion Y coefficient for Red Component 1:2:7 format</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>CSCRU</name>
                     <description>Color Space Conversion U coefficient for Red Component 1:2:7 format</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>CSCRV</name>
                     <description>Color Space Conversion V coefficient for Red Component 1:2:7 format</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>CSCYOFF</name>
                     <description>Color Space Conversion Offset</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOCFG15</name>
               <description>High End Overlay Configuration Register 15</description>
               <addressOffset>0x000003C8</addressOffset>
               <fields>
                  <field>
                     <name>CSCGY</name>
                     <description>Color Space Conversion Y coefficient for Green Component 1:2:7 format</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>CSCGU</name>
                     <description>Color Space Conversion U coefficient for Green Component 1:2:7 format</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>CSCGV</name>
                     <description>Color Space Conversion V coefficient for Green Component 1:2:7 format</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>CSCUOFF</name>
                     <description>Color Space Conversion Offset</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOCFG16</name>
               <description>High End Overlay Configuration Register 16</description>
               <addressOffset>0x000003CC</addressOffset>
               <fields>
                  <field>
                     <name>CSCBY</name>
                     <description>Color Space Conversion Y coefficient for Blue Component 1:2:7 format</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>CSCBU</name>
                     <description>Color Space Conversion U coefficient for Blue Component 1:2:7 format</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>CSCBV</name>
                     <description>Color Space Conversion V coefficient for Blue Component 1:2:7 format</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>CSCVOFF</name>
                     <description>Color Space Conversion Offset</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOCFG17</name>
               <description>High End Overlay Configuration Register 17</description>
               <addressOffset>0x000003D0</addressOffset>
               <fields>
                  <field>
                     <name>XPHI0COEFF0</name>
                     <description>Horizontal Coefficient for phase 0 tap 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>XPHI0COEFF1</name>
                     <description>Horizontal Coefficient for phase 0 tap 1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>XPHI0COEFF2</name>
                     <description>Horizontal Coefficient for phase 0 tap 2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>XPHI0COEFF3</name>
                     <description>Horizontal Coefficient for phase 0 tap 3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOCFG18</name>
               <description>High End Overlay Configuration Register 18</description>
               <addressOffset>0x000003D4</addressOffset>
               <fields>
                  <field>
                     <name>XPHI0COEFF4</name>
                     <description>Horizontal Coefficient for phase 0 tap 4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOCFG19</name>
               <description>High End Overlay Configuration Register 19</description>
               <addressOffset>0x000003D8</addressOffset>
               <fields>
                  <field>
                     <name>XPHI1COEFF0</name>
                     <description>Horizontal Coefficient for phase 1 tap 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>XPHI1COEFF1</name>
                     <description>Horizontal Coefficient for phase 1 tap 1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>XPHI1COEFF2</name>
                     <description>Horizontal Coefficient for phase 1 tap 2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>XPHI1COEFF3</name>
                     <description>Horizontal Coefficient for phase 1 tap 3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOCFG20</name>
               <description>High End Overlay Configuration Register 20</description>
               <addressOffset>0x000003DC</addressOffset>
               <fields>
                  <field>
                     <name>XPHI1COEFF4</name>
                     <description>Horizontal Coefficient for phase 1 tap 4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOCFG21</name>
               <description>High End Overlay Configuration Register 21</description>
               <addressOffset>0x000003E0</addressOffset>
               <fields>
                  <field>
                     <name>XPHI2COEFF0</name>
                     <description>Horizontal Coefficient for phase 2 tap 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>XPHI2COEFF1</name>
                     <description>Horizontal Coefficient for phase 2 tap 1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>XPHI2COEFF2</name>
                     <description>Horizontal Coefficient for phase 2 tap 2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>XPHI2COEFF3</name>
                     <description>Horizontal Coefficient for phase 2 tap 3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOCFG22</name>
               <description>High End Overlay Configuration Register 22</description>
               <addressOffset>0x000003E4</addressOffset>
               <fields>
                  <field>
                     <name>XPHI2COEFF4</name>
                     <description>Horizontal Coefficient for phase 2 tap 4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOCFG23</name>
               <description>High End Overlay Configuration Register 23</description>
               <addressOffset>0x000003E8</addressOffset>
               <fields>
                  <field>
                     <name>XPHI3COEFF0</name>
                     <description>Horizontal Coefficient for phase 3 tap 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>XPHI3COEFF1</name>
                     <description>Horizontal Coefficient for phase 3 tap 1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>XPHI3COEFF2</name>
                     <description>Horizontal Coefficient for phase 3 tap 2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>XPHI3COEFF3</name>
                     <description>Horizontal Coefficient for phase 3 tap 3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOCFG24</name>
               <description>High End Overlay Configuration Register 24</description>
               <addressOffset>0x000003EC</addressOffset>
               <fields>
                  <field>
                     <name>XPHI3COEFF4</name>
                     <description>Horizontal Coefficient for phase 3 tap 4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOCFG25</name>
               <description>High End Overlay Configuration Register 25</description>
               <addressOffset>0x000003F0</addressOffset>
               <fields>
                  <field>
                     <name>XPHI4COEFF0</name>
                     <description>Horizontal Coefficient for phase 4 tap 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>XPHI4COEFF1</name>
                     <description>Horizontal Coefficient for phase 4 tap 1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>XPHI4COEFF2</name>
                     <description>Horizontal Coefficient for phase 4 tap 2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>XPHI4COEFF3</name>
                     <description>Horizontal Coefficient for phase 4 tap 3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOCFG26</name>
               <description>High End Overlay Configuration Register 26</description>
               <addressOffset>0x000003F4</addressOffset>
               <fields>
                  <field>
                     <name>XPHI4COEFF4</name>
                     <description>Horizontal Coefficient for phase 4 tap 4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOCFG27</name>
               <description>High End Overlay Configuration Register 27</description>
               <addressOffset>0x000003F8</addressOffset>
               <fields>
                  <field>
                     <name>XPHI5COEFF0</name>
                     <description>Horizontal Coefficient for phase 5 tap 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>XPHI5COEFF1</name>
                     <description>Horizontal Coefficient for phase 5 tap 1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>XPHI5COEFF2</name>
                     <description>Horizontal Coefficient for phase 5 tap 2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>XPHI5COEFF3</name>
                     <description>Horizontal Coefficient for phase 5 tap 3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOCFG28</name>
               <description>High End Overlay Configuration Register 28</description>
               <addressOffset>0x000003FC</addressOffset>
               <fields>
                  <field>
                     <name>XPHI5COEFF4</name>
                     <description>Horizontal Coefficient for phase 5 tap 4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOCFG29</name>
               <description>High End Overlay Configuration Register 29</description>
               <addressOffset>0x00000400</addressOffset>
               <fields>
                  <field>
                     <name>XPHI6COEFF0</name>
                     <description>Horizontal Coefficient for phase 6 tap 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>XPHI6COEFF1</name>
                     <description>Horizontal Coefficient for phase 6 tap 1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>XPHI6COEFF2</name>
                     <description>Horizontal Coefficient for phase 6 tap 2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>XPHI6COEFF3</name>
                     <description>Horizontal Coefficient for phase 6 tap 3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOCFG30</name>
               <description>High End Overlay Configuration Register 30</description>
               <addressOffset>0x00000404</addressOffset>
               <fields>
                  <field>
                     <name>XPHI6COEFF4</name>
                     <description>Horizontal Coefficient for phase 6 tap 4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
