Ac6Embedded/svd-microchip/SAMA5D3/ATSAMA5D36.svd
            <register>
               <name>HEOCFG31</name>
               <description>High End Overlay Configuration Register 31</description>
               <addressOffset>0x00000408</addressOffset>
               <fields>
                  <field>
                     <name>XPHI7COEFF0</name>
                     <description>Horizontal Coefficient for phase 7 tap 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>XPHI7COEFF1</name>
                     <description>Horizontal Coefficient for phase 7 tap 1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>XPHI7COEFF2</name>
                     <description>Horizontal Coefficient for phase 7 tap 2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>XPHI7COEFF3</name>
                     <description>Horizontal Coefficient for phase 7 tap 3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOCFG32</name>
               <description>High End Overlay Configuration Register 32</description>
               <addressOffset>0x0000040C</addressOffset>
               <fields>
                  <field>
                     <name>XPHI7COEFF4</name>
                     <description>Horizontal Coefficient for phase 7 tap 4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOCFG33</name>
               <description>High End Overlay Configuration Register 33</description>
               <addressOffset>0x00000410</addressOffset>
               <fields>
                  <field>
                     <name>YPHI0COEFF0</name>
                     <description>Vertical Coefficient for phase 0 tap 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>YPHI0COEFF1</name>
                     <description>Vertical Coefficient for phase 0 tap 1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>YPHI0COEFF2</name>
                     <description>Vertical Coefficient for phase 0 tap 2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOCFG34</name>
               <description>High End Overlay Configuration Register 34</description>
               <addressOffset>0x00000414</addressOffset>
               <fields>
                  <field>
                     <name>YPHI1COEFF0</name>
                     <description>Vertical Coefficient for phase 1 tap 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>YPHI1COEFF1</name>
                     <description>Vertical Coefficient for phase 1 tap 1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>YPHI1COEFF2</name>
                     <description>Vertical Coefficient for phase 1 tap 2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOCFG35</name>
               <description>High End Overlay Configuration Register 35</description>
               <addressOffset>0x00000418</addressOffset>
               <fields>
                  <field>
                     <name>YPHI2COEFF0</name>
                     <description>Vertical Coefficient for phase 2 tap 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>YPHI2COEFF1</name>
                     <description>Vertical Coefficient for phase 2 tap 1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>YPHI2COEFF2</name>
                     <description>Vertical Coefficient for phase 2 tap 2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOCFG36</name>
               <description>High End Overlay Configuration Register 36</description>
               <addressOffset>0x0000041C</addressOffset>
               <fields>
                  <field>
                     <name>YPHI3COEFF0</name>
                     <description>Vertical Coefficient for phase 3 tap 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>YPHI3COEFF1</name>
                     <description>Vertical Coefficient for phase 3 tap 1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>YPHI3COEFF2</name>
                     <description>Vertical Coefficient for phase 3 tap 2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOCFG37</name>
               <description>High End Overlay Configuration Register 37</description>
               <addressOffset>0x00000420</addressOffset>
               <fields>
                  <field>
                     <name>YPHI4COEFF0</name>
                     <description>Vertical Coefficient for phase 4 tap 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>YPHI4COEFF1</name>
                     <description>Vertical Coefficient for phase 4 tap 1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>YPHI4COEFF2</name>
                     <description>Vertical Coefficient for phase 4 tap 2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOCFG38</name>
               <description>High End Overlay Configuration Register 38</description>
               <addressOffset>0x00000424</addressOffset>
               <fields>
                  <field>
                     <name>YPHI5COEFF0</name>
                     <description>Vertical Coefficient for phase 5 tap 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>YPHI5COEFF1</name>
                     <description>Vertical Coefficient for phase 5 tap 1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>YPHI5COEFF2</name>
                     <description>Vertical Coefficient for phase 5 tap 2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOCFG39</name>
               <description>High End Overlay Configuration Register 39</description>
               <addressOffset>0x00000428</addressOffset>
               <fields>
                  <field>
                     <name>YPHI6COEFF0</name>
                     <description>Vertical Coefficient for phase 6 tap 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>YPHI6COEFF1</name>
                     <description>Vertical Coefficient for phase 6 tap 1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>YPHI6COEFF2</name>
                     <description>Vertical Coefficient for phase 6 tap 2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOCFG40</name>
               <description>High End Overlay Configuration Register 40</description>
               <addressOffset>0x0000042C</addressOffset>
               <fields>
                  <field>
                     <name>YPHI7COEFF0</name>
                     <description>Vertical Coefficient for phase 7 tap 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>YPHI7COEFF1</name>
                     <description>Vertical Coefficient for phase 7 tap 1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>YPHI7COEFF2</name>
                     <description>Vertical Coefficient for phase 7 tap 2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOCFG41</name>
               <description>High End Overlay Configuration Register 41</description>
               <addressOffset>0x00000430</addressOffset>
               <fields>
                  <field>
                     <name>XPHIDEF</name>
                     <description>Horizontal Filter Phase Offset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>YPHIDEF</name>
                     <description>Vertical Filter Phase Offset</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HCRCHER</name>
               <description>Hardware Cursor Channel Enable Register</description>
               <addressOffset>0x00000440</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>CHEN</name>
                     <description>Channel Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UPDATEEN</name>
                     <description>Update Overlay Attributes Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>A2QEN</name>
                     <description>Add To Queue Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HCRCHDR</name>
               <description>Hardware Cursor Channel Disable Register</description>
               <addressOffset>0x00000444</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>CHDIS</name>
                     <description>Channel Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHRST</name>
                     <description>Channel Reset</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HCRCHSR</name>
               <description>Hardware Cursor Channel Status Register</description>
               <addressOffset>0x00000448</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CHSR</name>
                     <description>Channel Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UPDATESR</name>
                     <description>Update Overlay Attributes In Progress Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>A2QSR</name>
                     <description>Add To Queue Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HCRIER</name>
               <description>Hardware Cursor Interrupt Enable Register</description>
               <addressOffset>0x0000044C</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DMA</name>
                     <description>End of DMA Transfer Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSCR</name>
                     <description>Descriptor Loaded Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADD</name>
                     <description>Head Descriptor Loaded Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DONE</name>
                     <description>End of List Interrupt Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR</name>
                     <description>Overflow Interrupt Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HCRIDR</name>
               <description>Hardware Cursor Interrupt Disable Register</description>
               <addressOffset>0x00000450</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DMA</name>
                     <description>End of DMA Transfer Interrupt Disable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSCR</name>
                     <description>Descriptor Loaded Interrupt Disable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADD</name>
                     <description>Head Descriptor Loaded Interrupt Disable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DONE</name>
                     <description>End of List Interrupt Disable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR</name>
                     <description>Overflow Interrupt Disable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HCRIMR</name>
               <description>Hardware Cursor Interrupt Mask Register</description>
               <addressOffset>0x00000454</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DMA</name>
                     <description>End of DMA Transfer Interrupt Mask</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSCR</name>
                     <description>Descriptor Loaded Interrupt Mask</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADD</name>
                     <description>Head Descriptor Loaded Interrupt Mask</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DONE</name>
                     <description>End of List Interrupt Mask</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR</name>
                     <description>Overflow Interrupt Mask</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HCRISR</name>
               <description>Hardware Cursor Interrupt Status Register</description>
               <addressOffset>0x00000458</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DMA</name>
                     <description>End of DMA Transfer</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSCR</name>
                     <description>DMA Descriptor Loaded</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADD</name>
                     <description>Head Descriptor Loaded</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DONE</name>
                     <description>End of List Detected</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR</name>
                     <description>Overflow Detected</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HCRHEAD</name>
               <description>Hardware Cursor DMA Head Register</description>
               <addressOffset>0x0000045C</addressOffset>
               <fields>
                  <field>
                     <name>HEAD</name>
                     <description>DMA Head Pointer</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>30</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HCRADDR</name>
               <description>Hardware cursor DMA Address Register</description>
               <addressOffset>0x00000460</addressOffset>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>DMA Transfer Start Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HCRCTRL</name>
               <description>Hardware Cursor DMA Control Register</description>
               <addressOffset>0x00000464</addressOffset>
               <fields>
                  <field>
                     <name>DFETCH</name>
                     <description>Transfer Descriptor Fetch Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LFETCH</name>
                     <description>Lookup Table Fetch Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAIEN</name>
                     <description>End of DMA Transfer Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSCRIEN</name>
                     <description>Descriptor Loaded Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADDIEN</name>
                     <description>Add Head Descriptor to Queue Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DONEIEN</name>
                     <description>End of List Interrupt Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
