Ac6Embedded/svd-microchip/SAMA5D3/ATSAMA5D36.svd
            <register>
               <name>HCRNEXT</name>
               <description>Hardware Cursor DMA Next Register</description>
               <addressOffset>0x00000468</addressOffset>
               <fields>
                  <field>
                     <name>NEXT</name>
                     <description>DMA Descriptor Next Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HCRCFG0</name>
               <description>Hardware Cursor Configuration Register 0</description>
               <addressOffset>0x0000046C</addressOffset>
               <fields>
                  <field>
                     <name>SIF</name>
                     <description>Source Interface</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BLEN</name>
                     <description>AHB Burst Length</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>BLENSelect</name>
                        <enumeratedValue>
                           <name>AHB_BLEN_SINGLE</name>
                           <description>AHB Access is started as soon as there is enough space in the FIFO to store one data. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AHB_BLEN_INCR4</name>
                           <description>AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 4 data. An AHB INCR4 Burst is used. SINGLE, INCR and INCR4 bursts are used. INCR is used for a burst of 2 and 3 beats.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AHB_BLEN_INCR8</name>
                           <description>AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 8 data. An AHB INCR8 Burst is used. SINGLE, INCR, INCR4 and INCR8 bursts are used. INCR is used for a burst of 2 and 3 beats.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AHB_BLEN_INCR16</name>
                           <description>AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 16 data. An AHB INCR16 Burst is used. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DLBO</name>
                     <description>Defined Length Burst Only for Channel Bus Transaction</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HCRCFG1</name>
               <description>Hardware Cursor Configuration Register 1</description>
               <addressOffset>0x00000470</addressOffset>
               <fields>
                  <field>
                     <name>CLUTEN</name>
                     <description>Color Lookup Table Mode Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RGBMODE</name>
                     <description>RGB Mode Input Selection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>RGBMODESelect</name>
                        <enumeratedValue>
                           <name>_12BPP_RGB_444</name>
                           <description>12 bpp RGB 444</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16BPP_ARGB_4444</name>
                           <description>16 bpp ARGB 4444</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16BPP_RGBA_4444</name>
                           <description>16 bpp RGBA 4444</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16BPP_RGB_565</name>
                           <description>16 bpp RGB 565</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16BPP_TRGB_1555</name>
                           <description>16 bpp TRGB 1555</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_18BPP_RGB_666</name>
                           <description>18 bpp RGB 666</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_18BPP_RGB_666PACKED</name>
                           <description>18 bpp RGB 666 PACKED</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_19BPP_TRGB_1666</name>
                           <description>19 bpp TRGB 1666</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_19BPP_TRGB_PACKED</name>
                           <description>19 bpp TRGB 1666 PACKED</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_24BPP_RGB_888</name>
                           <description>24 bpp RGB 888</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_24BPP_RGB_888_PACKED</name>
                           <description>24 bpp RGB 888 PACKED</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_25BPP_TRGB_1888</name>
                           <description>25 bpp TRGB 1888</description>
                           <value>0xB</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32BPP_ARGB_8888</name>
                           <description>32 bpp ARGB 8888</description>
                           <value>0xC</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32BPP_RGBA_8888</name>
                           <description>32 bpp RGBA 8888</description>
                           <value>0xD</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLUTMODE</name>
                     <description>Color Lookup Table Mode Input Selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>CLUTMODESelect</name>
                        <enumeratedValue>
                           <name>CLUT_1BPP</name>
                           <description>Color Lookup Table mode set to 1 bit per pixel</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLUT_2BPP</name>
                           <description>Color Lookup Table mode set to 2 bits per pixel</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLUT_4BPP</name>
                           <description>Color Lookup Table mode set to 4 bits per pixel</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLUT_8BPP</name>
                           <description>Color Lookup Table mode set to 8 bits per pixel</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>HCRCFG2</name>
               <description>Hardware Cursor Configuration Register 2</description>
               <addressOffset>0x00000474</addressOffset>
               <fields>
                  <field>
                     <name>XPOS</name>
                     <description>Horizontal Window Position</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>YPOS</name>
                     <description>Vertical Window Position</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HCRCFG3</name>
               <description>Hardware Cursor Configuration Register 3</description>
               <addressOffset>0x00000478</addressOffset>
               <fields>
                  <field>
                     <name>XSIZE</name>
                     <description>Horizontal Window Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>YSIZE</name>
                     <description>Vertical Window Size</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HCRCFG4</name>
               <description>Hardware Cursor Configuration Register 4</description>
               <addressOffset>0x0000047C</addressOffset>
               <fields>
                  <field>
                     <name>XSTRIDE</name>
                     <description>Horizontal Stride</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HCRCFG6</name>
               <description>Hardware Cursor Configuration Register 6</description>
               <addressOffset>0x00000484</addressOffset>
               <fields>
                  <field>
                     <name>BDEF</name>
                     <description>Blue Default</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>GDEF</name>
                     <description>Green Default</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RDEF</name>
                     <description>Red Default</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HCRCFG7</name>
               <description>Hardware Cursor Configuration Register 7</description>
               <addressOffset>0x00000488</addressOffset>
               <fields>
                  <field>
                     <name>BKEY</name>
                     <description>Blue Color Component Chroma Key</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>GKEY</name>
                     <description>Green Color Component Chroma Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RKEY</name>
                     <description>Red Color Component Chroma Key</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HCRCFG8</name>
               <description>Hardware Cursor Configuration Register 8</description>
               <addressOffset>0x0000048C</addressOffset>
               <fields>
                  <field>
                     <name>BMASK</name>
                     <description>Blue Color Component Chroma Key Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>GMASK</name>
                     <description>Green Color Component Chroma Key Mask</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RMASK</name>
                     <description>Red Color Component Chroma Key Mask</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HCRCFG9</name>
               <description>Hardware Cursor Configuration Register 9</description>
               <addressOffset>0x00000490</addressOffset>
               <fields>
                  <field>
                     <name>CRKEY</name>
                     <description>Blender Chroma Key Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INV</name>
                     <description>Blender Inverted Blender Output Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ITER2BL</name>
                     <description>Blender Iterated Color Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ITER</name>
                     <description>Blender Use Iterated Color</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REVALPHA</name>
                     <description>Blender Reverse Alpha</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GAEN</name>
                     <description>Blender Global Alpha Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAEN</name>
                     <description>Blender Local Alpha Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR</name>
                     <description>Blender Overlay Layer Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA</name>
                     <description>Blender DMA Layer Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REP</name>
                     <description>Use Replication logic to expand RGB color to 24 bits</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSTKEY</name>
                     <description>Destination Chroma Keying</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GA</name>
                     <description>Blender Global Alpha</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PPCHER</name>
               <description>Post Processing Channel Enable Register</description>
               <addressOffset>0x00000540</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>CHEN</name>
                     <description>Channel Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UPDATEEN</name>
                     <description>Update Overlay Attributes Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>A2QEN</name>
                     <description>Add To Queue Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PPCHDR</name>
               <description>Post Processing Channel Disable Register</description>
               <addressOffset>0x00000544</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>CHDIS</name>
                     <description>Channel Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHRST</name>
                     <description>Channel Reset</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PPCHSR</name>
               <description>Post Processing Channel Status Register</description>
               <addressOffset>0x00000548</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CHSR</name>
                     <description>Channel Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UPDATESR</name>
                     <description>Update Overlay Attributes In Progress Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>A2QSR</name>
                     <description>Add To Queue Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PPIER</name>
               <description>Post Processing Interrupt Enable Register</description>
               <addressOffset>0x0000054C</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DMA</name>
                     <description>End of DMA Transfer Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSCR</name>
                     <description>Descriptor Loaded Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADD</name>
                     <description>Head Descriptor Loaded Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DONE</name>
                     <description>End of List Interrupt Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
