Ac6Embedded/svd-microchip/SAMA5D3/ATSAMA5D36.svd
            <register>
               <name>LPR</name>
               <description>MPDDRC Low-power Register</description>
               <addressOffset>0x1C</addressOffset>
               <fields>
                  <field>
                     <name>LPCB</name>
                     <description>Low-power Command Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>LPCBSelect</name>
                        <enumeratedValue>
                           <name>NOLOWPOWER</name>
                           <description>Low-power feature is inhibited. No Power-down, Self-refresh and Deep-power modes are issued to the DDR-SDRAM device.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SELFREFRESH</name>
                           <description>The MPDDRC issues a self-refresh command to the DDR-SDRAM device, the clock(s) is/are deactivated and the CKE signal is set low. The DDR-SDRAM device leaves the Self-refresh mode when accessed and reenters it after the access.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>POWERDOWN</name>
                           <description>The MPDDRC issues a Power-down command to the DDR-SDRAM device after each access, the CKE signal is set low. The DDR-SDRAM device leaves the Power-down mode when accessed and reenters it after the access.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DEEPPOWERDOWN</name>
                           <description>The MPDDRC issues a Deep Power-down command to the low-power DDR-SDRAM device.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLK_FR</name>
                     <description>Clock Frozen Command Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>CLK_FRSelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Clock(s) is/are not frozen.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Clock(s) is/are frozen.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LPDDR2_PWOFF</name>
                     <description>LPDDR2 - LPDDR3 Power Off Bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>LPDDR2_PWOFFSelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>No power-off sequence applied to LPDDR2.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>A power-off sequence is applied to the LPDDR2 device. CKE is forced low.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PASR</name>
                     <description>Partial Array Self-refresh</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>DS</name>
                     <description>Drive Strength</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>DSSelect</name>
                        <enumeratedValue>
                           <name>DS_FULL</name>
                           <description>Full drive strength</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DS_HALF</name>
                           <description>Half drive strength</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DS_QUARTER</name>
                           <description>Quarter drive strength</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DS_OCTANT</name>
                           <description>Octant drive strength</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TIMEOUT</name>
                     <description>Time Between Last Transfer and Low-Power Mode</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TIMEOUTSelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>SDRAM Low-power mode is activated immediately after the end of the last transfer.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DELAY_64_CLK</name>
                           <description>SDRAM Low-power mode is activated 64 clock cycles after the end of the last transfer.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DELAY_128_CLK</name>
                           <description>SDRAM Low-power mode is activated 128 clock cycles after the end of the last transfer.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>APDE</name>
                     <description>Active Power Down Exit Time</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>APDESelect</name>
                        <enumeratedValue>
                           <name>DDR2_FAST_EXIT</name>
                           <description>Fast Exit from Power Down. DDR2-SDRAM devices only.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DDR2_SLOW_EXIT</name>
                           <description>Slow Exit from Power Down. DDR2-SDRAM devices only.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UPD_MR</name>
                     <description>Update Load Mode Register and Extended Mode Register</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>UPD_MRSelect</name>
                        <enumeratedValue>
                           <name>NO_UPDATE</name>
                           <description>Update of Load Mode and Extended Mode registers is disabled.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UPDATE_SHAREDBUS</name>
                           <description>MPDDRC shares an external bus. Automatic update is done during a refresh command and a pending read or write access in the SDRAM device.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UPDATE_NOSHAREDBUS</name>
                           <description>MPDDRC does not share an external bus. Automatic update is done before entering Self-refresh mode.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>MD</name>
               <description>MPDDRC Memory Device Register</description>
               <addressOffset>0x20</addressOffset>
               <fields>
                  <field>
                     <name>MD</name>
                     <description>Memory Device</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>MDSelect</name>
                        <enumeratedValue>
                           <name>LPDDR_SDRAM</name>
                           <description>Low-power DDR1-SDRAM</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DDR2_SDRAM</name>
                           <description>DDR2-SDRAM</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPDDR2_SDRAM</name>
                           <description>Low-power DDR2-SDRAM</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DBW</name>
                     <description>Data Bus Width</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>DBWSelect</name>
                        <enumeratedValue>
                           <name>DBW_32_BITS</name>
                           <description>Data bus width is 32 bits</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>HS</name>
               <description>MPDDRC High Speed Register</description>
               <addressOffset>0x24</addressOffset>
               <fields>
                  <field>
                     <name>DIS_ANTICIP_READ</name>
                     <description>Disable Anticip Read Access</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN_CALIB</name>
                     <description>Enable of the Calibration</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>EN_CALIBSelect</name>
                        <enumeratedValue>
                           <name>DISABLE_CALIBRATION</name>
                           <description>Calibration is disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE_CALIBRATION</name>
                           <description>Calibration is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>LPDDR2_LPR</name>
               <description>MPDDRC LPDDR2 Low-power Register</description>
               <addressOffset>0x28</addressOffset>
               <fields>
                  <field>
                     <name>BK_MASK_PASR</name>
                     <description>Bank Mask Bit/PASR</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>SEG_MASK</name>
                     <description>Segment Mask Bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>DS</name>
                     <description>Drive Strength</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>DSSelect</name>
                        <enumeratedValue>
                           <name>DS_34_3</name>
                           <description>34.3 ohm typical</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DS_40</name>
                           <description>40 ohm typical (default)</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DS_48</name>
                           <description>48 ohm typical</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DS_60</name>
                           <description>60 ohm typical</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DS_80</name>
                           <description>80 ohm typical</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DS_120</name>
                           <description>120 ohm typical</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>LPDDR2_CAL_MR4</name>
               <description>MPDDRC Low-power DDR2 Calibration and MR4 Register</description>
               <addressOffset>0x2C</addressOffset>
               <fields>
                  <field>
                     <name>COUNT_CAL</name>
                     <description>LPDDR2Calibration Timer Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>MR4_READ</name>
                     <description>Mode Register 4 Read Interval</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LPDDR2_TIM_CAL</name>
               <description>MPDDRC Low-power DDR2 Timing Calibration Register</description>
               <addressOffset>0x30</addressOffset>
               <fields>
                  <field>
                     <name>ZQCS</name>
                     <description>ZQ Calibration Short</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IO_CALIBR</name>
               <description>MPDDRC IO Calibration</description>
               <addressOffset>0x34</addressOffset>
               <fields>
                  <field>
                     <name>RDIV</name>
                     <description>Resistor Divider, Output Driver Impedance</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>RDIVSelect</name>
                        <enumeratedValue>
                           <name>RZQ_34</name>
                           <description>LP-DDR2 serial impedance line = 34.3 ohms,DDR2/LP-DDR1 serial impedance line: Not applicable</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RZQ_40_RZQ_33_3</name>
                           <description>LP-DDR2 serial impedance line = 40 ohms,DDR2/LP-DDR1 serial impedance line = 33.3 ohms</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RZQ_48_RZQ_40</name>
                           <description>LP-DDR2 serial impedance line = 48 ohms,DDR2/LP-DDR1 serial impedance line = 40 ohms</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RZQ_60_RZQ_50</name>
                           <description>LP-DDR2 serial impedance line = 60 ohms,DDR2/LP-DDR1 serial impedance line = 50 ohms</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RZQ_80_RZQ_66_7</name>
                           <description>LP-DDR2 serial impedance line = 80 ohms,DDR2/LP-DDR1 serial impedance line = 66.7 ohms</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RZQ_120_RZQ_100</name>
                           <description>LP-DDR2 serial impedance line = 120 ohms,DDR2/LP-DDR1 serial impedance line = 100 ohms</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TZQIO</name>
                     <description>IO Calibration</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>CALCODEP</name>
                     <description>Number of Transistor P</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CALCODEN</name>
                     <description>Number of Transistor N</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OCMS</name>
               <description>MPDDRC OCMS Register</description>
               <addressOffset>0x38</addressOffset>
               <fields>
                  <field>
                     <name>SCR_EN</name>
                     <description>Scrambling Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OCMS_KEY1</name>
               <description>MPDDRC OCMS KEY1 Register</description>
               <addressOffset>0x3C</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>KEY1</name>
                     <description>Off-chip Memory Scrambling (OCMS) Key Part 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OCMS_KEY2</name>
               <description>MPDDRC OCMS KEY2 Register</description>
               <addressOffset>0x40</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>KEY2</name>
                     <description>Off-chip Memory Scrambling (OCMS) Key Part 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
