Ac6Embedded/svd-microchip/SAMA5D3/ATSAMA5D36.svd
            <register>
               <name>DLL_MO</name>
               <description>MPDDRC DLL Master Offset Register</description>
               <addressOffset>0x74</addressOffset>
               <fields>
                  <field>
                     <name>MOFF</name>
                     <description>DLL Master Delay Line Offset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CLK90OFF</name>
                     <description>DLL CLK90 Delay Line Offset</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SELOFF</name>
                     <description>DLL Offset Selection</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DLL_SOF</name>
               <description>MPDDRC DLL Slave Offset Register</description>
               <addressOffset>0x78</addressOffset>
               <fields>
                  <field>
                     <name>S0OFF</name>
                     <description>DLL Slave 0 Delay Line Offset ([x = 0..3])</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>S1OFF</name>
                     <description>DLL Slave 1 Delay Line Offset ([x = 0..3])</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>S2OFF</name>
                     <description>DLL Slave 2 Delay Line Offset ([x = 0..3])</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>S3OFF</name>
                     <description>DLL Slave 3 Delay Line Offset ([x = 0..3])</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DLL_MS</name>
               <description>MPDDRC DLL Status Master Register</description>
               <addressOffset>0x7C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MDINC</name>
                     <description>DLL Master Delay Increment</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MDDEC</name>
                     <description>DLL Master Delay Decrement</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MDOVF</name>
                     <description>DLL Master Delay Overflow Flag</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MDVAL</name>
                     <description>DLL Master Delay Value</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>DLL_SS[%s]</name>
               <description>MPDDRC DLL Status Slave 0 Register</description>
               <addressOffset>0x80</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>SDCOVF</name>
                     <description>DLL Slave x Delay Correction Overflow Flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SDCUDF</name>
                     <description>DLL Slave x Delay Correction Underflow Flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SDERF</name>
                     <description>DLL Slave x Delay Correction Error Flag</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SDVAL</name>
                     <description>DLL Slave x Delay Value</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>SDCVAL</name>
                     <description>DLL Slave x Delay Correction Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WPMR</name>
               <description>MPDDRC Write Protection Mode Register</description>
               <addressOffset>0xE4</addressOffset>
               <fields>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protection Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.</description>
                           <value>0x444452</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>WPSR</name>
               <description>MPDDRC Write Protection Status Register</description>
               <addressOffset>0xE8</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>WPVS</name>
                     <description>Write Protection Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPVSRC</name>
                     <description>Write Protection Violation Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
