Ac6Embedded/svd-microchip/SAMA5D3/ATSAMA5D36.svd
            <cluster>
               <dim>4</dim>
               <dimIncrement>32</dimIncrement>
               <name>PWM_CH_NUM[%s]</name>
               <description/>
               <addressOffset>0x200</addressOffset>
               <register>
                  <name>CMR</name>
                  <description>PWM Channel Mode Register</description>
                  <addressOffset>0x0</addressOffset>
                  <fields>
                     <field>
                        <name>CPRE</name>
                        <description>Channel Pre-scaler</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>CPRESelect</name>
                           <enumeratedValue>
                              <name>MCK</name>
                              <description>Peripheral clock</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MCK_DIV_2</name>
                              <description>Peripheral clock/2</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MCK_DIV_4</name>
                              <description>Peripheral clock/4</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MCK_DIV_8</name>
                              <description>Peripheral clock/8</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MCK_DIV_16</name>
                              <description>Peripheral clock/16</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MCK_DIV_32</name>
                              <description>Peripheral clock/32</description>
                              <value>0x5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MCK_DIV_64</name>
                              <description>Peripheral clock/64</description>
                              <value>0x6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MCK_DIV_128</name>
                              <description>Peripheral clock/128</description>
                              <value>0x7</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MCK_DIV_256</name>
                              <description>Peripheral clock/256</description>
                              <value>0x8</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MCK_DIV_512</name>
                              <description>Peripheral clock/512</description>
                              <value>0x9</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MCK_DIV_1024</name>
                              <description>Peripheral clock/1024</description>
                              <value>0xA</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CLKA</name>
                              <description>Clock A</description>
                              <value>0xB</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CLKB</name>
                              <description>Clock B</description>
                              <value>0xC</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>CALG</name>
                        <description>Channel Alignment</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CPOL</name>
                        <description>Channel Polarity</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CES</name>
                        <description>Counter Event Selection</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DTE</name>
                        <description>Dead-Time Generator Enable</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DTHI</name>
                        <description>Dead-Time PWMHx Output Inverted</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DTLI</name>
                        <description>Dead-Time PWMLx Output Inverted</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CDTY</name>
                  <description>PWM Channel Duty Cycle Register</description>
                  <addressOffset>0x4</addressOffset>
                  <fields>
                     <field>
                        <name>CDTY</name>
                        <description>Channel Duty-Cycle</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>24</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CDTYUPD</name>
                  <description>PWM Channel Duty Cycle Update Register</description>
                  <addressOffset>0x8</addressOffset>
                  <access>write-only</access>
                  <fields>
                     <field>
                        <name>CDTYUPD</name>
                        <description>Channel Duty-Cycle Update</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>24</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CPRD</name>
                  <description>PWM Channel Period Register</description>
                  <addressOffset>0xC</addressOffset>
                  <fields>
                     <field>
                        <name>CPRD</name>
                        <description>Channel Period</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>24</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CPRDUPD</name>
                  <description>PWM Channel Period Update Register</description>
                  <addressOffset>0x10</addressOffset>
                  <access>write-only</access>
                  <fields>
                     <field>
                        <name>CPRDUPD</name>
                        <description>Channel Period Update</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>24</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CCNT</name>
                  <description>PWM Channel Counter Register</description>
                  <addressOffset>0x14</addressOffset>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>CNT</name>
                        <description>Channel Counter Register</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>24</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DT</name>
                  <description>PWM Channel Dead Time Register</description>
                  <addressOffset>0x18</addressOffset>
                  <fields>
                     <field>
                        <name>DTH</name>
                        <description>Dead-Time Value for PWMHx Output</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>DTL</name>
                        <description>Dead-Time Value for PWMLx Output</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DTUPD</name>
                  <description>PWM Channel Dead Time Update Register</description>
                  <addressOffset>0x1C</addressOffset>
                  <access>write-only</access>
                  <fields>
                     <field>
                        <name>DTHUPD</name>
                        <description>Dead-Time Value Update for PWMHx Output</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>DTLUPD</name>
                        <description>Dead-Time Value Update for PWMLx Output</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
