Ac6Embedded/svd-microchip/SAMA5D3/ATSAMA5D36.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>RSTC</name>
         <version>6098M</version>
         <description>Reset Controller</description>
         <baseAddress>0xFFFFFE00</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xC</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CR</name>
               <description>Control Register</description>
               <addressOffset>0x00</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>PROCRST</name>
                     <description>Processor Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PERRST</name>
                     <description>Peripheral Reset</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTRST</name>
                     <description>External Reset</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>KEY</name>
                     <description>Write Access Password</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>KEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation.Always reads as 0.</description>
                           <value>0xA5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR</name>
               <description>Status Register</description>
               <addressOffset>0x04</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>URSTS</name>
                     <description>User Reset Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSTTYP</name>
                     <description>Reset Type</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>RSTTYPSelect</name>
                        <enumeratedValue>
                           <name>GENERAL_RST</name>
                           <description>Both VDDCORE and VDDBU rising</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WKUP_RST</name>
                           <description>VDDCORE rising</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WDT_RST</name>
                           <description>Watchdog fault occurred</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SOFT_RST</name>
                           <description>Processor reset required by the software</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>USER_RST</name>
                           <description>NRST pin detected low</description>
                           <value>0x4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NRSTL</name>
                     <description>NRST Pin Level</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRCMP</name>
                     <description>Software Reset Command in Progress</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MR</name>
               <description>Mode Register</description>
               <addressOffset>0x08</addressOffset>
               <fields>
                  <field>
                     <name>ERSTL</name>
                     <description>External Reset Length</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>KEY</name>
                     <description>Write Access Password</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>KEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation.Always reads as 0.</description>
                           <value>0xA5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
