Ac6Embedded/svd-microchip/SAMA5D3/ATSAMA5D36.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>SCKC</name>
         <version>11073G</version>
         <description>Slow Clock Controller</description>
         <baseAddress>0xFFFFFE50</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CR</name>
               <description>Slow Clock Controller Configuration Register</description>
               <addressOffset>0x0</addressOffset>
               <fields>
                  <field>
                     <name>RCEN</name>
                     <description>Embedded 32 kHz (typical) RC Oscillator</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSC32EN</name>
                     <description>32.768 kHz Crystal Oscillator</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSC32BYP</name>
                     <description>32.768 kHz Crystal Oscillator Bypass</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSCSEL</name>
                     <description>Slow Clock Selector</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>OSCSELSelect</name>
                        <enumeratedValue>
                           <name>RC</name>
                           <description>Slow clock is the embedded 32 kHz (typical) RC oscillator.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>XTAL</name>
                           <description>Slow clock is the 32.768 kHz crystal oscillator.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>SFR</name>
         <version>11066N</version>
         <description>Special Function Registers</description>
         <baseAddress>0xF0038000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x44</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>DDRCFG</name>
               <description>DDR Configuration Register</description>
               <addressOffset>0x04</addressOffset>
               <fields>
                  <field>
                     <name>FDQIEN</name>
                     <description>Force DDR_DQ Input Buffer Always On</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FDQSIEN</name>
                     <description>Force DDR_DQS Input Buffer Always On</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OHCIICR</name>
               <description>OHCI Interrupt Configuration Register</description>
               <addressOffset>0x10</addressOffset>
               <fields>
                  <field>
                     <name>RES0</name>
                     <description>USB PORTx RESET</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RES1</name>
                     <description>USB PORTx RESET</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RES2</name>
                     <description>USB PORTx RESET</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ARIE</name>
                     <description>OHCI Asynchronous Resume Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>APPSTART</name>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UDPPUDIS</name>
                     <description>USB DEVICE PULL-UP DISABLE</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OHCIISR</name>
               <description>OHCI Interrupt Status Register</description>
               <addressOffset>0x14</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RIS0</name>
                     <description>OHCI Resume Interrupt Status Port 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RIS1</name>
                     <description>OHCI Resume Interrupt Status Port 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RIS2</name>
                     <description>OHCI Resume Interrupt Status Port 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SECURE</name>
               <description>Security Configuration Register</description>
               <addressOffset>0x28</addressOffset>
               <fields>
                  <field>
                     <name>ROM</name>
                     <description>Disable Access to ROM Code</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FUSE</name>
                     <description>Disable Access to Fuse Controller</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UTMICKTRIM</name>
               <description>UTMI Clock Trimming Register</description>
               <addressOffset>0x30</addressOffset>
               <fields>
                  <field>
                     <name>FREQ</name>
                     <description>UTMI Reference Clock Frequency</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>FREQSelect</name>
                        <enumeratedValue>
                           <name>_12</name>
                           <description>12 MHz reference clock</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16</name>
                           <description>16 MHz reference clock</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_24</name>
                           <description>24 MHz reference clock</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_48</name>
                           <description>48 MHz reference clock</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>EBICFG</name>
               <description>EBI Configuration Register</description>
               <addressOffset>0x40</addressOffset>
               <fields>
                  <field>
                     <name>DRIVE0</name>
                     <description>EBI Pins Drive Level</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>DRIVE0Select</name>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Low drive level</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MEDIUM</name>
                           <description>Medium drive level</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>High drive level</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PULL0</name>
                     <description>EBI Pins Pull Value</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>PULL0Select</name>
                        <enumeratedValue>
                           <name>UP</name>
                           <description>Pull-up</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Pull</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DOWN</name>
                           <description>Pull-down</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SCH0</name>
                     <description>EBI Pins Schmitt Trigger</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRIVE1</name>
                     <description>EBI Pins Drive Level</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>DRIVE1Select</name>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Low drive level</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MEDIUM</name>
                           <description>Medium drive level</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>High drive level</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PULL1</name>
                     <description>EBI Pins Pull Value</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>PULL1Select</name>
                        <enumeratedValue>
                           <name>UP</name>
                           <description>Pull-up</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Pull</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DOWN</name>
                           <description>Pull-down</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SCH1</name>
                     <description>EBI Pins Schmitt Trigger</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BMS</name>
                     <description>BMS Sampled Value (Read Only)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>BMSSelect</name>
                        <enumeratedValue>
                           <name>ROM</name>
                           <description>Boot on ROM.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EBI</name>
                           <description>Boot on EBI.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
