Ac6Embedded/svd-microchip/SAMA5D3/ATSAMA5D36.svd
            <register>
               <name>HSMC_IMR</name>
               <description>HSMC NFC Interrupt Mask Register</description>
               <addressOffset>0x014</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RB_RISE</name>
                     <description>Ready Busy Rising Edge Detection Interrupt Mask</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RB_FALL</name>
                     <description>Ready Busy Falling Edge Detection Interrupt Mask</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XFRDONE</name>
                     <description>Transfer Done Interrupt Mask</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMDDONE</name>
                     <description>Command Done Interrupt Mask</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DTOE</name>
                     <description>Data Timeout Error Interrupt Mask</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UNDEF</name>
                     <description>Undefined Area Access Interrupt Mask5</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWB</name>
                     <description>Accessing While Busy Interrupt Mask</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NFCASE</name>
                     <description>NFC Access Size Error Interrupt Mask</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RB_EDGE0</name>
                     <description>Ready/Busy Line 0 Interrupt Mask</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_ADDR</name>
               <description>HSMC NFC Address Cycle Zero Register</description>
               <addressOffset>0x018</addressOffset>
               <fields>
                  <field>
                     <name>ADDR_CYCLE0</name>
                     <description>NAND Flash Array Address Cycle 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_BANK</name>
               <description>HSMC Bank Address Register</description>
               <addressOffset>0x01C</addressOffset>
               <fields>
                  <field>
                     <name>BANK</name>
                     <description>Bank Identifier</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_PMECCFG</name>
               <description>PMECC Configuration Register</description>
               <addressOffset>0x070</addressOffset>
               <fields>
                  <field>
                     <name>BCH_ERR</name>
                     <description>Error Correcting Capability</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>BCH_ERRSelect</name>
                        <enumeratedValue>
                           <name>BCH_ERR2</name>
                           <description>2 errors</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BCH_ERR4</name>
                           <description>4 errors</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BCH_ERR8</name>
                           <description>8 errors</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BCH_ERR12</name>
                           <description>12 errors</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BCH_ERR24</name>
                           <description>24 errors</description>
                           <value>0x4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SECTORSZ</name>
                     <description>Sector Size</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PAGESIZE</name>
                     <description>Number of Sectors in the Page</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>PAGESIZESelect</name>
                        <enumeratedValue>
                           <name>PAGESIZE_1SEC</name>
                           <description>1 sector for main area (512 or 1024 bytes)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PAGESIZE_2SEC</name>
                           <description>2 sectors for main area (1024 or 2048 bytes)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PAGESIZE_4SEC</name>
                           <description>4 sectors for main area (2048 or 4096 bytes)</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PAGESIZE_8SEC</name>
                           <description>8 sectors for main area (4096 or 8192 bytes)</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NANDWR</name>
                     <description>NAND Write Access</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPAREEN</name>
                     <description>Spare Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AUTO</name>
                     <description>Automatic Mode Enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_PMECCSAREA</name>
               <description>PMECC Spare Area Size Register</description>
               <addressOffset>0x074</addressOffset>
               <fields>
                  <field>
                     <name>SPARESIZE</name>
                     <description>Spare Area Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_PMECCSADDR</name>
               <description>PMECC Start Address Register</description>
               <addressOffset>0x078</addressOffset>
               <fields>
                  <field>
                     <name>STARTADDR</name>
                     <description>ECC Area Start Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_PMECCEADDR</name>
               <description>PMECC End Address Register</description>
               <addressOffset>0x07C</addressOffset>
               <fields>
                  <field>
                     <name>ENDADDR</name>
                     <description>ECC Area End Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_PMECCTRL</name>
               <description>PMECC Control Register</description>
               <addressOffset>0x084</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RST</name>
                     <description>Reset the PMECC Module</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATA</name>
                     <description>Start a Data Phase</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER</name>
                     <description>Start a User Mode Phase</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>PMECC Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISABLE</name>
                     <description>PMECC Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_PMECCSR</name>
               <description>PMECC Status Register</description>
               <addressOffset>0x088</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>BUSY</name>
                     <description>The kernel of the PMECC is busy</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>PMECC Enable bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_PMECCIER</name>
               <description>PMECC Interrupt Enable register</description>
               <addressOffset>0x08C</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>ERRIE</name>
                     <description>Error Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_PMECCIDR</name>
               <description>PMECC Interrupt Disable Register</description>
               <addressOffset>0x090</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>ERRID</name>
                     <description>Error Interrupt Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_PMECCIMR</name>
               <description>PMECC Interrupt Mask Register</description>
               <addressOffset>0x094</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ERRIM</name>
                     <description>Error Interrupt Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_PMECCISR</name>
               <description>PMECC Interrupt Status Register</description>
               <addressOffset>0x098</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ERRIS</name>
                     <description>Error Interrupt Status Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>8</dim>
               <dimIncrement>64</dimIncrement>
               <name>SMC_PMECC[%s]</name>
               <description/>
               <addressOffset>0xB0</addressOffset>
               <register>
                  <dim>11</dim>
                  <dimIncrement>4</dimIncrement>
                  <name>HSMC_PMECC[%s]</name>
                  <description>PMECC Redundancy 0 Register (sec_num = 0)</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>ECC</name>
                        <description>BCH Redundancy</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <cluster>
               <dim>8</dim>
               <dimIncrement>64</dimIncrement>
               <name>SMC_REM[%s]</name>
               <description/>
               <addressOffset>0x2B0</addressOffset>
               <register>
                  <dim>12</dim>
                  <dimIncrement>4</dimIncrement>
                  <name>HSMC_REM[%s]</name>
                  <description>PMECC Remainder 0 Register (sec_num = 0)</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>REM2NP1</name>
                        <description>BCH Remainder 2 * N + 1</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>14</bitWidth>
                     </field>
                     <field>
                        <name>REM2NP3</name>
                        <description>BCH Remainder 2 * N + 3</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>14</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <register>
               <name>HSMC_ELCFG</name>
               <description>PMECC Error Location Configuration Register</description>
               <addressOffset>0x500</addressOffset>
               <fields>
                  <field>
                     <name>SECTORSZ</name>
                     <description>Sector Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERRNUM</name>
                     <description>Number of Errors</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_ELPRIM</name>
               <description>PMECC Error Location Primitive Register</description>
               <addressOffset>0x504</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PRIMITIV</name>
                     <description>Primitive Polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_ELEN</name>
               <description>PMECC Error Location Enable Register</description>
               <addressOffset>0x508</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>ENINIT</name>
                     <description>Error Location Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_ELDIS</name>
               <description>PMECC Error Location Disable Register</description>
               <addressOffset>0x50C</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DIS</name>
                     <description>Disable Error Location Engine</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_ELSR</name>
               <description>PMECC Error Location Status Register</description>
               <addressOffset>0x510</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>BUSY</name>
                     <description>Error Location Engine Busy</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_ELIER</name>
               <description>PMECC Error Location Interrupt Enable register</description>
               <addressOffset>0x514</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DONE</name>
                     <description>Computation Terminated Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_ELIDR</name>
               <description>PMECC Error Location Interrupt Disable Register</description>
               <addressOffset>0x518</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DONE</name>
                     <description>Computation Terminated Interrupt Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_ELIMR</name>
               <description>PMECC Error Location Interrupt Mask Register</description>
               <addressOffset>0x51C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DONE</name>
                     <description>Computation Terminated Interrupt Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_ELISR</name>
               <description>PMECC Error Location Interrupt Status Register</description>
               <addressOffset>0x520</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DONE</name>
                     <description>Computation Terminated Interrupt Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERR_CNT</name>
                     <description>Error Counter value</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA0</name>
               <description>PMECC Error Location SIGMA 0 Register</description>
               <addressOffset>0x528</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>SIGMA0</name>
                     <description>Coefficient of degree 0 in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA1</name>
               <description>PMECC Error Location SIGMA 1 Register</description>
               <addressOffset>0x52C</addressOffset>
               <fields>
                  <field>
                     <name>SIGMA1</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
