Ac6Embedded/svd-microchip/SAMA5D3/ATSAMA5D36.svd
            <register>
               <name>HSMC_SIGMA2</name>
               <description>PMECC Error Location SIGMA 2 Register</description>
               <addressOffset>0x530</addressOffset>
               <fields>
                  <field>
                     <name>SIGMA2</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA3</name>
               <description>PMECC Error Location SIGMA 3 Register</description>
               <addressOffset>0x534</addressOffset>
               <fields>
                  <field>
                     <name>SIGMA3</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA4</name>
               <description>PMECC Error Location SIGMA 4 Register</description>
               <addressOffset>0x538</addressOffset>
               <fields>
                  <field>
                     <name>SIGMA4</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA5</name>
               <description>PMECC Error Location SIGMA 5 Register</description>
               <addressOffset>0x53C</addressOffset>
               <fields>
                  <field>
                     <name>SIGMA5</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA6</name>
               <description>PMECC Error Location SIGMA 6 Register</description>
               <addressOffset>0x540</addressOffset>
               <fields>
                  <field>
                     <name>SIGMA6</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA7</name>
               <description>PMECC Error Location SIGMA 7 Register</description>
               <addressOffset>0x544</addressOffset>
               <fields>
                  <field>
                     <name>SIGMA7</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA8</name>
               <description>PMECC Error Location SIGMA 8 Register</description>
               <addressOffset>0x548</addressOffset>
               <fields>
                  <field>
                     <name>SIGMA8</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA9</name>
               <description>PMECC Error Location SIGMA 9 Register</description>
               <addressOffset>0x54C</addressOffset>
               <fields>
                  <field>
                     <name>SIGMA9</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA10</name>
               <description>PMECC Error Location SIGMA 10 Register</description>
               <addressOffset>0x550</addressOffset>
               <fields>
                  <field>
                     <name>SIGMA10</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA11</name>
               <description>PMECC Error Location SIGMA 11 Register</description>
               <addressOffset>0x554</addressOffset>
               <fields>
                  <field>
                     <name>SIGMA11</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA12</name>
               <description>PMECC Error Location SIGMA 12 Register</description>
               <addressOffset>0x558</addressOffset>
               <fields>
                  <field>
                     <name>SIGMA12</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA13</name>
               <description>PMECC Error Location SIGMA 13 Register</description>
               <addressOffset>0x55C</addressOffset>
               <fields>
                  <field>
                     <name>SIGMA13</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA14</name>
               <description>PMECC Error Location SIGMA 14 Register</description>
               <addressOffset>0x560</addressOffset>
               <fields>
                  <field>
                     <name>SIGMA14</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA15</name>
               <description>PMECC Error Location SIGMA 15 Register</description>
               <addressOffset>0x564</addressOffset>
               <fields>
                  <field>
                     <name>SIGMA15</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA16</name>
               <description>PMECC Error Location SIGMA 16 Register</description>
               <addressOffset>0x568</addressOffset>
               <fields>
                  <field>
                     <name>SIGMA16</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA17</name>
               <description>PMECC Error Location SIGMA 17 Register</description>
               <addressOffset>0x56C</addressOffset>
               <fields>
                  <field>
                     <name>SIGMA17</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA18</name>
               <description>PMECC Error Location SIGMA 18 Register</description>
               <addressOffset>0x570</addressOffset>
               <fields>
                  <field>
                     <name>SIGMA18</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA19</name>
               <description>PMECC Error Location SIGMA 19 Register</description>
               <addressOffset>0x574</addressOffset>
               <fields>
                  <field>
                     <name>SIGMA19</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA20</name>
               <description>PMECC Error Location SIGMA 20 Register</description>
               <addressOffset>0x578</addressOffset>
               <fields>
                  <field>
                     <name>SIGMA20</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA21</name>
               <description>PMECC Error Location SIGMA 21 Register</description>
               <addressOffset>0x57C</addressOffset>
               <fields>
                  <field>
                     <name>SIGMA21</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA22</name>
               <description>PMECC Error Location SIGMA 22 Register</description>
               <addressOffset>0x580</addressOffset>
               <fields>
                  <field>
                     <name>SIGMA22</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA23</name>
               <description>PMECC Error Location SIGMA 23 Register</description>
               <addressOffset>0x584</addressOffset>
               <fields>
                  <field>
                     <name>SIGMA23</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA24</name>
               <description>PMECC Error Location SIGMA 24 Register</description>
               <addressOffset>0x588</addressOffset>
               <fields>
                  <field>
                     <name>SIGMA24</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>24</dim>
               <dimIncrement>4</dimIncrement>
               <name>HSMC_ERRLOC[%s]</name>
               <description>PMECC Error Location 0 Register</description>
               <addressOffset>0x58C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ERRLOCN</name>
                     <description>Error Position within the Set {sector area, spare area}</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>4</dim>
               <dimIncrement>20</dimIncrement>
               <name>SMC_CS_NUMBER[%s]</name>
               <description/>
               <addressOffset>0x600</addressOffset>
               <register>
                  <name>HSMC_SETUP</name>
                  <description>HSMC Setup Register</description>
                  <addressOffset>0x0</addressOffset>
                  <fields>
                     <field>
                        <name>NWE_SETUP</name>
                        <description>NWE Setup Length</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                     <field>
                        <name>NCS_WR_SETUP</name>
                        <description>NCS Setup Length in Write Access</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                     <field>
                        <name>NRD_SETUP</name>
                        <description>NRD Setup Length</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                     <field>
                        <name>NCS_RD_SETUP</name>
                        <description>NCS Setup Length in Read Access</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>HSMC_PULSE</name>
                  <description>HSMC Pulse Register</description>
                  <addressOffset>0x4</addressOffset>
                  <fields>
                     <field>
                        <name>NWE_PULSE</name>
                        <description>NWE Pulse Length</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                     <field>
                        <name>NCS_WR_PULSE</name>
                        <description>NCS Pulse Length in WRITE Access</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                     <field>
                        <name>NRD_PULSE</name>
                        <description>NRD Pulse Length</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                     <field>
                        <name>NCS_RD_PULSE</name>
                        <description>NCS Pulse Length in READ Access</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>HSMC_CYCLE</name>
                  <description>HSMC Cycle Register</description>
                  <addressOffset>0x8</addressOffset>
                  <fields>
                     <field>
                        <name>NWE_CYCLE</name>
                        <description>Total Write Cycle Length</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>9</bitWidth>
                     </field>
                     <field>
                        <name>NRD_CYCLE</name>
                        <description>Total Read Cycle Length</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>9</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>HSMC_TIMINGS</name>
                  <description>HSMC Timings Register</description>
                  <addressOffset>0xC</addressOffset>
                  <fields>
                     <field>
                        <name>TCLR</name>
                        <description>CLE to REN Low Delay</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>TADL</name>
                        <description>ALE to Data Start</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>TAR</name>
                        <description>ALE to REN Low Delay</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>OCMS</name>
                        <description>Off Chip Memory Scrambling Enable</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TRR</name>
                        <description>Ready to REN Low Delay</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>TWB</name>
                        <description>WEN High to REN to Busy</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>RBNSEL</name>
                        <description>Ready/Busy Line Selection</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                     <field>
                        <name>NFSEL</name>
                        <description>NAND Flash Selection</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
