Ac6Embedded/svd-microchip/SAMA5D3/ATSAMA5D36.svd
               <register>
                  <name>HSMC_MODE</name>
                  <description>HSMC Mode Register</description>
                  <addressOffset>0x10</addressOffset>
                  <fields>
                     <field>
                        <name>READ_MODE</name>
                        <description>Selection of the Control Signal for Read Operation</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>READ_MODESelect</name>
                           <enumeratedValue>
                              <name>NCS_CTRL</name>
                              <description>The Read operation is controlled by the NCS signal.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>NRD_CTRL</name>
                              <description>The Read operation is controlled by the NRD signal.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>WRITE_MODE</name>
                        <description>Selection of the Control Signal for Write Operation</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>WRITE_MODESelect</name>
                           <enumeratedValue>
                              <name>NCS_CTRL</name>
                              <description>The Write operation is controller by the NCS signal.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>NWE_CTRL</name>
                              <description>The Write operation is controlled by the NWE signal</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>EXNW_MODE</name>
                        <description>NWAIT Mode</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>EXNW_MODESelect</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Disabled-The NWAIT input signal is ignored on the corresponding Chip Select.</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FROZEN</name>
                              <description>Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped.</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>READY</name>
                              <description>Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high.</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>BAT</name>
                        <description>Byte Access Type</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>BATSelect</name>
                           <enumeratedValue>
                              <name>BYTE_SELECT</name>
                              <description>Byte select access type:- Write operation is controlled using NCS, NWE, NBS0, NBS1.- Read operation is controlled using NCS, NRD, NBS0, NBS1.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>BYTE_WRITE</name>
                              <description>Byte write access type:- Write operation is controlled using NCS, NWR0, NWR1.- Read operation is controlled using NCS and NRD.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DBW</name>
                        <description>Data Bus Width</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>DBWSelect</name>
                           <enumeratedValue>
                              <name>BIT_8</name>
                              <description>8-bit bus</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>BIT_16</name>
                              <description>16-bit bus</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>TDF_CYCLES</name>
                        <description>Data Float Time</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>TDF_MODE</name>
                        <description>TDF Optimization</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <register>
               <name>HSMC_OCMS</name>
               <description>HSMC Off Chip Memory Scrambling Register</description>
               <addressOffset>0x6A0</addressOffset>
               <fields>
                  <field>
                     <name>SMSE</name>
                     <description>Static Memory Controller Scrambling Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRSE</name>
                     <description>NFC Internal SRAM Scrambling Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_KEY1</name>
               <description>HSMC Off Chip Memory Scrambling KEY1 Register</description>
               <addressOffset>0x6A4</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>KEY1</name>
                     <description>Off Chip Memory Scrambling (OCMS) Key Part 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_KEY2</name>
               <description>HSMC Off Chip Memory Scrambling KEY2 Register</description>
               <addressOffset>0x6A8</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>KEY2</name>
                     <description>Off Chip Memory Scrambling (OCMS) Key Part 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_WPMR</name>
               <description>HSMC Write Protection Mode Register</description>
               <addressOffset>0x6E4</addressOffset>
               <fields>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protection Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of bit WPEN.Always reads as 0.</description>
                           <value>0x534D43</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_WPSR</name>
               <description>HSMC Write Protection Status Register</description>
               <addressOffset>0x6E8</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>WPVS</name>
                     <description>Write Protection Violation Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPVSRC</name>
                     <description>Write Protection Violation Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
