Ac6Embedded/svd-microchip/SAMA5D3/ATSAMA5D36.svd
               <register>
                  <name>SMMR</name>
                  <description>Stepper Motor Mode Register</description>
                  <addressOffset>0x8</addressOffset>
                  <fields>
                     <field>
                        <name>GCEN</name>
                        <description>Gray Count Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DOWN</name>
                        <description>Down Count</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CV</name>
                  <description>Counter Value</description>
                  <addressOffset>0x10</addressOffset>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>CV</name>
                        <description>Counter Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RA</name>
                  <description>Register A</description>
                  <addressOffset>0x14</addressOffset>
                  <fields>
                     <field>
                        <name>RA</name>
                        <description>Register A</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RB</name>
                  <description>Register B</description>
                  <addressOffset>0x18</addressOffset>
                  <fields>
                     <field>
                        <name>RB</name>
                        <description>Register B</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RC</name>
                  <description>Register C</description>
                  <addressOffset>0x1C</addressOffset>
                  <fields>
                     <field>
                        <name>RC</name>
                        <description>Register C</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>SR</name>
                  <description>Status Register</description>
                  <addressOffset>0x20</addressOffset>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>COVFS</name>
                        <description>Counter Overflow Status (cleared on read)</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LOVRS</name>
                        <description>Load Overrun Status (cleared on read)</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CPAS</name>
                        <description>RA Compare Status (cleared on read)</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CPBS</name>
                        <description>RB Compare Status (cleared on read)</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CPCS</name>
                        <description>RC Compare Status (cleared on read)</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LDRAS</name>
                        <description>RA Loading Status (cleared on read)</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LDRBS</name>
                        <description>RB Loading Status (cleared on read)</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ETRGS</name>
                        <description>External Trigger Status (cleared on read)</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CLKSTA</name>
                        <description>Clock Enabling Status</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MTIOA</name>
                        <description>TIOA Mirror</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MTIOB</name>
                        <description>TIOB Mirror</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>IER</name>
                  <description>Interrupt Enable Register</description>
                  <addressOffset>0x24</addressOffset>
                  <access>write-only</access>
                  <fields>
                     <field>
                        <name>COVFS</name>
                        <description>Counter Overflow</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LOVRS</name>
                        <description>Load Overrun</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CPAS</name>
                        <description>RA Compare</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CPBS</name>
                        <description>RB Compare</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CPCS</name>
                        <description>RC Compare</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LDRAS</name>
                        <description>RA Loading</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LDRBS</name>
                        <description>RB Loading</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ETRGS</name>
                        <description>External Trigger</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>IDR</name>
                  <description>Interrupt Disable Register</description>
                  <addressOffset>0x28</addressOffset>
                  <access>write-only</access>
                  <fields>
                     <field>
                        <name>COVFS</name>
                        <description>Counter Overflow</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LOVRS</name>
                        <description>Load Overrun</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CPAS</name>
                        <description>RA Compare</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CPBS</name>
                        <description>RB Compare</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CPCS</name>
                        <description>RC Compare</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LDRAS</name>
                        <description>RA Loading</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LDRBS</name>
                        <description>RB Loading</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ETRGS</name>
                        <description>External Trigger</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>IMR</name>
                  <description>Interrupt Mask Register</description>
                  <addressOffset>0x2C</addressOffset>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>COVFS</name>
                        <description>Counter Overflow</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LOVRS</name>
                        <description>Load Overrun</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CPAS</name>
                        <description>RA Compare</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CPBS</name>
                        <description>RB Compare</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CPCS</name>
                        <description>RC Compare</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LDRAS</name>
                        <description>RA Loading</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LDRBS</name>
                        <description>RB Loading</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ETRGS</name>
                        <description>External Trigger</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <register>
               <name>BCR</name>
               <description>Block Control Register</description>
               <addressOffset>0xC0</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>SYNC</name>
                     <description>Synchro Command</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BMR</name>
               <description>Block Mode Register</description>
               <addressOffset>0xC4</addressOffset>
               <fields>
                  <field>
                     <name>TC0XC0S</name>
                     <description>External Clock Signal 0 Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TC0XC0SSelect</name>
                        <enumeratedValue>
                           <name>TCLK0</name>
                           <description>Signal connected to XC0: TCLK0</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TIOA1</name>
                           <description>Signal connected to XC0: TIOA1</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TIOA2</name>
                           <description>Signal connected to XC0: TIOA2</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TC1XC1S</name>
                     <description>External Clock Signal 1 Selection</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TC1XC1SSelect</name>
                        <enumeratedValue>
                           <name>TCLK1</name>
                           <description>Signal connected to XC1: TCLK1</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TIOA0</name>
                           <description>Signal connected to XC1: TIOA0</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TIOA2</name>
                           <description>Signal connected to XC1: TIOA2</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TC2XC2S</name>
                     <description>External Clock Signal 2 Selection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TC2XC2SSelect</name>
                        <enumeratedValue>
                           <name>TCLK2</name>
                           <description>Signal connected to XC2: TCLK2</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TIOA0</name>
                           <description>Signal connected to XC2: TIOA0</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TIOA1</name>
                           <description>Signal connected to XC2: TIOA1</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>FMR</name>
               <description>Fault Mode Register</description>
               <addressOffset>0xD8</addressOffset>
               <fields>
                  <field>
                     <name>ENCF0</name>
                     <description>Enable Compare Fault Channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENCF1</name>
                     <description>Enable Compare Fault Channel 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WPMR</name>
               <description>Write Protection Mode Register</description>
               <addressOffset>0xE4</addressOffset>
               <fields>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protection Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.</description>
                           <value>0x54494D</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
