Ac6Embedded/svd-microchip/SAMA5D3/ATSAMA5D36.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="TWI0">
         <name>TWI1</name>
         <baseAddress>0xF0018000</baseAddress>
         <interrupt>
            <name>TWI1</name>
            <description>Two-Wire Interface 1</description>
            <value>19</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="TWI0">
         <name>TWI2</name>
         <baseAddress>0xF801C000</baseAddress>
         <interrupt>
            <name>TWI2</name>
            <description>Two-Wire Interface 2</description>
            <value>20</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>UART0</name>
         <version>6418Q</version>
         <description>Universal Asynchronous Receiver Transmitter</description>
         <groupName>UART</groupName>
         <prependToName>UART_</prependToName>
         <baseAddress>0xF0024000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x24</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>UART0</name>
            <description>UART 0</description>
            <value>16</value>
         </interrupt>
         <registers>
            <register>
               <name>CR</name>
               <description>Control Register</description>
               <addressOffset>0x0000</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RSTRX</name>
                     <description>Reset Receiver</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSTTX</name>
                     <description>Reset Transmitter</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXEN</name>
                     <description>Receiver Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXDIS</name>
                     <description>Receiver Disable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXEN</name>
                     <description>Transmitter Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXDIS</name>
                     <description>Transmitter Disable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSTSTA</name>
                     <description>Reset Status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MR</name>
               <description>Mode Register</description>
               <addressOffset>0x0004</addressOffset>
               <fields>
                  <field>
                     <name>PAR</name>
                     <description>Parity Type</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>PARSelect</name>
                        <enumeratedValue>
                           <name>EVEN</name>
                           <description>Even Parity</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ODD</name>
                           <description>Odd Parity</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPACE</name>
                           <description>Space: parity forced to 0</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MARK</name>
                           <description>Mark: parity forced to 1</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No parity</description>
                           <value>0x4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CHMODE</name>
                     <description>Channel Mode</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>CHMODESelect</name>
                        <enumeratedValue>
                           <name>NORMAL</name>
                           <description>Normal mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AUTOMATIC</name>
                           <description>Automatic echo</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOCAL_LOOPBACK</name>
                           <description>Local loopback</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REMOTE_LOOPBACK</name>
                           <description>Remote loopback</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>IER</name>
               <description>Interrupt Enable Register</description>
               <addressOffset>0x0008</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RXRDY</name>
                     <description>Enable RXRDY Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXRDY</name>
                     <description>Enable TXRDY Interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE</name>
                     <description>Enable Overrun Error Interrupt</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRAME</name>
                     <description>Enable Framing Error Interrupt</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PARE</name>
                     <description>Enable Parity Error Interrupt</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXEMPTY</name>
                     <description>Enable TXEMPTY Interrupt</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IDR</name>
               <description>Interrupt Disable Register</description>
               <addressOffset>0x000C</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RXRDY</name>
                     <description>Disable RXRDY Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXRDY</name>
                     <description>Disable TXRDY Interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE</name>
                     <description>Disable Overrun Error Interrupt</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRAME</name>
                     <description>Disable Framing Error Interrupt</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PARE</name>
                     <description>Disable Parity Error Interrupt</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXEMPTY</name>
                     <description>Disable TXEMPTY Interrupt</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IMR</name>
               <description>Interrupt Mask Register</description>
               <addressOffset>0x0010</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXRDY</name>
                     <description>Mask RXRDY Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXRDY</name>
                     <description>Disable TXRDY Interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE</name>
                     <description>Mask Overrun Error Interrupt</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRAME</name>
                     <description>Mask Framing Error Interrupt</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PARE</name>
                     <description>Mask Parity Error Interrupt</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXEMPTY</name>
                     <description>Mask TXEMPTY Interrupt</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR</name>
               <description>Status Register</description>
               <addressOffset>0x0014</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXRDY</name>
                     <description>Receiver Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXRDY</name>
                     <description>Transmitter Ready</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE</name>
                     <description>Overrun Error</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRAME</name>
                     <description>Framing Error</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PARE</name>
                     <description>Parity Error</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXEMPTY</name>
                     <description>Transmitter Empty</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RHR</name>
               <description>Receive Holding Register</description>
               <addressOffset>0x0018</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXCHR</name>
                     <description>Received Character</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>THR</name>
               <description>Transmit Holding Register</description>
               <addressOffset>0x001C</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>TXCHR</name>
                     <description>Character to be Transmitted</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BRGR</name>
               <description>Baud Rate Generator Register</description>
               <addressOffset>0x0020</addressOffset>
               <fields>
                  <field>
                     <name>CD</name>
                     <description>Clock Divisor</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
