Ac6Embedded/svd-microchip/SAMA5D3/ATSAMA5D36.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="UART0">
         <name>UART1</name>
         <baseAddress>0xF8028000</baseAddress>
         <interrupt>
            <name>UART1</name>
            <description>UART 1</description>
            <value>17</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>UDPHS</name>
         <version>6227S</version>
         <description>USB High Speed Device Port</description>
         <baseAddress>0xF8030000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x370</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>UDPHS</name>
            <description>USB Device High Speed</description>
            <value>33</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRL</name>
               <description>UDPHS Control Register</description>
               <addressOffset>0x00</addressOffset>
               <fields>
                  <field>
                     <name>DEV_ADDR</name>
                     <description>UDPHS Address (cleared upon USB reset)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>FADDR_EN</name>
                     <description>Function Address Enable (cleared upon USB reset)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN_UDPHS</name>
                     <description>UDPHS Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DETACH</name>
                     <description>Detach Command</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REWAKEUP</name>
                     <description>Send Remote Wake Up (cleared upon USB reset)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PULLD_DIS</name>
                     <description>Pull-Down Disable (cleared upon USB reset)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FNUM</name>
               <description>UDPHS Frame Number Register</description>
               <addressOffset>0x04</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MICRO_FRAME_NUM</name>
                     <description>Microframe Number (cleared upon USB reset)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>FRAME_NUMBER</name>
                     <description>Frame Number as defined in the Packet Field Formats (cleared upon USB reset)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>FNUM_ERR</name>
                     <description>Frame Number CRC Error (cleared upon USB reset)</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IEN</name>
               <description>UDPHS Interrupt Enable Register</description>
               <addressOffset>0x10</addressOffset>
               <fields>
                  <field>
                     <name>DET_SUSPD</name>
                     <description>Suspend Interrupt Enable (cleared upon USB reset)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MICRO_SOF</name>
                     <description>Micro-SOF Interrupt Enable (cleared upon USB reset)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INT_SOF</name>
                     <description>SOF Interrupt Enable (cleared upon USB reset)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENDRESET</name>
                     <description>End Of Reset Interrupt Enable (cleared upon USB reset)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAKE_UP</name>
                     <description>Wake Up CPU Interrupt Enable (cleared upon USB reset)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENDOFRSM</name>
                     <description>End Of Resume Interrupt Enable (cleared upon USB reset)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UPSTR_RES</name>
                     <description>Upstream Resume Interrupt Enable (cleared upon USB reset)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_0</name>
                     <description>Endpoint 0 Interrupt Enable (cleared upon USB reset)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_1</name>
                     <description>Endpoint 1 Interrupt Enable (cleared upon USB reset)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_2</name>
                     <description>Endpoint 2 Interrupt Enable (cleared upon USB reset)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_3</name>
                     <description>Endpoint 3 Interrupt Enable (cleared upon USB reset)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_4</name>
                     <description>Endpoint 4 Interrupt Enable (cleared upon USB reset)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_5</name>
                     <description>Endpoint 5 Interrupt Enable (cleared upon USB reset)</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_6</name>
                     <description>Endpoint 6 Interrupt Enable (cleared upon USB reset)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_7</name>
                     <description>Endpoint 7 Interrupt Enable (cleared upon USB reset)</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_8</name>
                     <description>Endpoint 8 Interrupt Enable (cleared upon USB reset)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_9</name>
                     <description>Endpoint 9 Interrupt Enable (cleared upon USB reset)</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_10</name>
                     <description>Endpoint 10 Interrupt Enable (cleared upon USB reset)</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_11</name>
                     <description>Endpoint 11 Interrupt Enable (cleared upon USB reset)</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_12</name>
                     <description>Endpoint 12 Interrupt Enable (cleared upon USB reset)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_13</name>
                     <description>Endpoint 13 Interrupt Enable (cleared upon USB reset)</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_14</name>
                     <description>Endpoint 14 Interrupt Enable (cleared upon USB reset)</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_15</name>
                     <description>Endpoint 15 Interrupt Enable (cleared upon USB reset)</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA_1</name>
                     <description>DMA Channel 1 Interrupt Enable (cleared upon USB reset)</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA_2</name>
                     <description>DMA Channel 2 Interrupt Enable (cleared upon USB reset)</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA_3</name>
                     <description>DMA Channel 3 Interrupt Enable (cleared upon USB reset)</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA_4</name>
                     <description>DMA Channel 4 Interrupt Enable (cleared upon USB reset)</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA_5</name>
                     <description>DMA Channel 5 Interrupt Enable (cleared upon USB reset)</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA_6</name>
                     <description>DMA Channel 6 Interrupt Enable (cleared upon USB reset)</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA_7</name>
                     <description>DMA Channel 7 Interrupt Enable (cleared upon USB reset)</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTSTA</name>
               <description>UDPHS Interrupt Status Register</description>
               <addressOffset>0x14</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>SPEED</name>
                     <description>Speed Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET_SUSPD</name>
                     <description>Suspend Interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MICRO_SOF</name>
                     <description>Micro Start Of Frame Interrupt</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INT_SOF</name>
                     <description>Start Of Frame Interrupt</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENDRESET</name>
                     <description>End Of Reset Interrupt</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAKE_UP</name>
                     <description>Wake Up CPU Interrupt</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENDOFRSM</name>
                     <description>End Of Resume Interrupt</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UPSTR_RES</name>
                     <description>Upstream Resume Interrupt</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_0</name>
                     <description>Endpoint 0 Interrupt (cleared upon USB reset)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_1</name>
                     <description>Endpoint 1 Interrupt (cleared upon USB reset)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_2</name>
                     <description>Endpoint 2 Interrupt (cleared upon USB reset)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_3</name>
                     <description>Endpoint 3 Interrupt (cleared upon USB reset)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_4</name>
                     <description>Endpoint 4 Interrupt (cleared upon USB reset)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_5</name>
                     <description>Endpoint 5 Interrupt (cleared upon USB reset)</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_6</name>
                     <description>Endpoint 6 Interrupt (cleared upon USB reset)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_7</name>
                     <description>Endpoint 7 Interrupt (cleared upon USB reset)</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_8</name>
                     <description>Endpoint 8 Interrupt (cleared upon USB reset)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_9</name>
                     <description>Endpoint 9 Interrupt (cleared upon USB reset)</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_10</name>
                     <description>Endpoint 10 Interrupt (cleared upon USB reset)</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_11</name>
                     <description>Endpoint 11 Interrupt (cleared upon USB reset)</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_12</name>
                     <description>Endpoint 12 Interrupt (cleared upon USB reset)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_13</name>
                     <description>Endpoint 13 Interrupt (cleared upon USB reset)</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_14</name>
                     <description>Endpoint 14 Interrupt (cleared upon USB reset)</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPT_15</name>
                     <description>Endpoint 15 Interrupt (cleared upon USB reset)</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA_1</name>
                     <description>DMA Channel 1 Interrupt</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA_2</name>
                     <description>DMA Channel 2 Interrupt</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA_3</name>
                     <description>DMA Channel 3 Interrupt</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA_4</name>
                     <description>DMA Channel 4 Interrupt</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA_5</name>
                     <description>DMA Channel 5 Interrupt</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA_6</name>
                     <description>DMA Channel 6 Interrupt</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA_7</name>
                     <description>DMA Channel 7 Interrupt</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLRINT</name>
               <description>UDPHS Clear Interrupt Register</description>
               <addressOffset>0x18</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DET_SUSPD</name>
                     <description>Suspend Interrupt Clear</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MICRO_SOF</name>
                     <description>Micro Start Of Frame Interrupt Clear</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INT_SOF</name>
                     <description>Start Of Frame Interrupt Clear</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENDRESET</name>
                     <description>End Of Reset Interrupt Clear</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAKE_UP</name>
                     <description>Wake Up CPU Interrupt Clear</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENDOFRSM</name>
                     <description>End Of Resume Interrupt Clear</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UPSTR_RES</name>
                     <description>Upstream Resume Interrupt Clear</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
